{
    "status": "ok",
    "total_articles": 284,
    "articles": [
        {
            "published_date": "2025-05-18T23:58:34",
            "title": "Canadian Bitcoin Miner POW.RE to Acquire Swiss Firm Block Green",
            "author": "Bitcoin",
            "url": "https://article.wn.com/view/2025/05/18/Canadian_Bitcoin_Miner_POWRE_to_Acquire_Swiss_Firm_Block_Gre",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "POW.RE Holdings Limited announced plans to acquire Swiss bitcoin liquidity protocol Block Green AG in Canadian bitcoin mining firm POW.RE. Holdings Limited is a Canadian-based company. Block Green is a Swiss-based Bitcoin Lettuce protocol provider.   "
        },
        {
            "published_date": "2025-05-18T23:29:43",
            "title": "The Hidden Momentum in Web3—These 5 Could Be the Best Altcoins to Buy This Weekend",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/other/the-hidden-momentum-in-web3-these-5-could-be-the-best-altcoins-to-buy-this-weekend/ar-AA1F1aEI",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Qubetics is an emerging Layer-1 protocol that anchors a development-first vision. Its two flagship platforms, QubeQode and Qubetics IDE, empower developers to build Web3-native applications with unparalleled cross-chain interoperability. Its presale has raised more than $17 million, with 512 million $TICS tokens sold and over 26,500 holders onboarded. Its launch is scheduled for Sunday at 12 a.m. with a 10% increment. "
        },
        {
            "published_date": "2025-05-18T23:28:00",
            "title": "Is Crown Coins Casino Real Money? All You Need to Know 2025",
            "author": "Nebojša Vujinović",
            "url": "https://www.southwestjournal.com/gambling/is-crown-coins-casino-real-money",
            "url_media": "https://www.southwestjournal.com/wp-content/uploads/2025/05/Crown-Coins-Casino.jpg",
            "country": "US",
            "language": "en",
            "summary": "Crown Coins Casino allows users to play casino-style games using virtual coins and redeem their winnings for cash. The platform uses a sweepstakes model based on two virtual currencies: Crown Coins (CC) and Sweepstakes Coins (SC). New users receive a welcome bonus package, which includes 100,000 CC and 2 SC."
        },
        {
            "published_date": "2025-05-18T23:24:11",
            "title": "As Fortunes Rise, So Do Fears: Crypto Elite Worry About Safety",
            "author": "Ari Haruni",
            "url": "https://wallstreetpit.com/126891-as-fortunes-rise-so-do-fears-crypto-elite-worry-about-safety",
            "url_media": "https://wallstreetpit.com/wp-content/uploads/2025/03/cryptos-G1.jpg",
            "country": "US",
            "language": "en",
            "summary": "Coinbase spent $6.2 million on CEO Brian Armstrong's security last year, surpassing the combined security costs for CEOs of JPMorgan Chase (JPM), Goldman Sachs (GS), and Nvidia (NVDA). Jethro Pijlman of Infinite Risks International reports an increase in inquiries and contracts from crypto investors seeking 'intelligent security measures' as an essential cost of operating in this high-risk environment."
        },
        {
            "published_date": "2025-05-18T23:15:29",
            "title": "Top 5 Altcoins to Watch in Q3: Analysts Rank XRP, Cardano, and MAGACOIN FINANCE for Explosive Potential",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/markets/top-5-altcoins-to-watch-in-q3-analysts-rank-xrp-cardano-and-magacoin-finance-for-explosive-potential/ar-AA1F15Iq",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "As the third quarter of 2025 approaches, traders and analysts will be looking for opportunities to identify coins that are ready to breakout. Here's a list of five altcoins that some of the best analysts in the space are currently monitoring, and the data behind their upward momentum."
        },
        {
            "published_date": "2025-05-18T23:15:00",
            "title": "Analysts Highlight 4 Picks That Could Be the Best Altcoins to Buy for May 2025",
            "author": "Tribune Online",
            "url": "https://tribuneonlineng.com/analysts-highlight-4-picks-that-could-be-the-best-altcoins-to-buy-for-may-2025",
            "url_media": "https://tribuneonlineng.com/wp-content/uploads/2025/05/image-102.png",
            "country": "NG",
            "language": "en",
            "summary": "As the market matures, investors are looking for altcoins with real infrastructure value. Qubetics is taking a clear lead with its focus on inter-chain communication and operability between blockchains. Its structured presale strategy and a fast-approaching mainnet make it one of the best altcoins to buy for May 2025."
        },
        {
            "published_date": "2025-05-18T23:14:22",
            "title": "Thread by @CryptoMachineG on Thread Reader App",
            "author": "",
            "url": "https://threadreaderapp.com/thread/1924242185622368737.html",
            "url_media": "https://threadreaderapp.com/images/screenshots/thread/1924242185622368737.jpg",
            "country": "US",
            "language": "en",
            "summary": "Web3 Weekly Walkthru (May 12-18) looks at the state of the crypto market. Bitcoin is strong, institutions and regulators are waking up. Deutsche Börse launches 3DX. NFTs have +17% sales spike. Tezos bets on tokenized uranium. PYTH challenges the data cartel. Smart contracts are shipping."
        },
        {
            "published_date": "2025-05-18T23:14:01",
            "title": "What China's spies are doing in the U.S., and what happens when they're caught",
            "author": "Norah",
            "url": "https://www.cbsnews.com/news/what-chinas-spies-do-in-the-us-what-happens-when-theyre-caught-60-minutes-transcript",
            "url_media": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/05/16/cac31755-d728-4936-b934-b7a369305293/thumbnail/1200x630/682738409ccbe129e3258663f5545675/gettyimages-2150094845.jpg?v=6df9366690ed146f169dd0670c453f91",
            "country": "US",
            "language": "en",
            "summary": "China is expanding its spying efforts in the U.S. Since President Xi Jinping came to power in 2012, China's spies no longer seem to fear the United States. China's Ministry of State Security is now the largest and most active spy agency in the world. Its main target is China's own people."
        },
        {
            "published_date": "2025-05-18T23:05:18",
            "title": "Is Zula Casino Real Money? All You Need to Know in 2025",
            "author": "Nebojša Vujinović",
            "url": "https://www.southwestjournal.com/gambling/is-zula-casino-real-money",
            "url_media": "https://www.southwestjournal.com/wp-content/uploads/2025/05/Beginners-guide-to-Zula-Casino.jpg",
            "country": "US",
            "language": "en",
            "summary": "Zula Casino uses virtual currencies for gameplay and prize redemption. Sweeps Coins (SCs) can be exchanged for real prizes such as gift cards and cash at the casino. Zula Casino does not pay out real money through traditional gambling. It operates as a social casino focusing on entertainment rather than cash rewards."
        },
        {
            "published_date": "2025-05-18T23:04:32",
            "title": "Latam Insights: Meliuz Purchases 274 BTC in Brazil; Argentine Wallets Face Potential Extinction",
            "author": "Bitcoin",
            "url": "https://article.wn.com/view/2025/05/18/Latam_Insights_Meliuz_Purchases_274_BTC_in_Brazil_Argentine_",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Latam Insights is a compilation of the most relevant crypto news from Latin America over the past week. In this week's edition, we look at the latest crypto news in Latin America from this region. It's also about the recent developments in the Bitcoin industry."
        },
        {
            "published_date": "2025-05-18T23:00:31",
            "title": "'My Coworkers Think I'm DOGE'—A Federal Worker Says, 'I Receive Mean Looks And Conversations Are Straight-Up Dying When I Walk By'",
            "author": "Adrian Volenik",
            "url": "https://finance.yahoo.com/news/coworkers-think-im-doge-federal-230031600.html",
            "url_media": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png",
            "country": "US",
            "language": "en",
            "summary": "A young federal employee was wrongly mistaken for a Department of Government Efficiency operative when he returned to the office after remote work. The post gained thousands of upvotes and sparked hundreds of replies on Reddit. The topic triggered a larger conversation about the distrust in federal workplaces in the current political climate."
        },
        {
            "published_date": "2025-05-18T23:00:12",
            "title": "Ethereum (ETH) Is Up 55.3% in a Month, But Investors Are Rushing to Get in On Ruvi AI (RUVI) Thanks to 100% Early Bonus",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/markets/ethereum-eth-is-up-55-3-in-a-month-but-investors-are-rushing-to-get-in-on-ruvi-ai-ruvi-thanks-to-100-early-bonus/ar-AA1F0Zfd",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Ruvi is an AI-powered application ecosystem designed to empower users with the ability to create text, audio, video, and image content easily. Ruvi's entry into the market has already gained tremendous momentum. Phase 1 of its presale sold out in just over two weeks, delivering early investors an impressive 50% gain. Analysts forecast Ruvi will be valued at $1 in the future."
        },
        {
            "published_date": "2025-05-18T22:34:42",
            "title": "Arthur Hayes on Bitcoin's route to $200,000, holding gold and why ‘hated' Ethereum is due for a comeback",
            "author": "Anna Tutova",
            "url": "https://www.msn.com/en-us/money/markets/arthur-hayes-on-bitcoin-s-route-to-200-000-holding-gold-and-why-hated-ethereum-is-due-for-a-comeback/ar-AA1F138r",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Arthur Hayes co-founded the BitMEX exchange in 2014. He received a full pardon from President Donald Trump this year. Hayes is now managing Maelstrom, the fund run by his family. He predicts Bitcoin could hit $200,000 in the near term and $1 million by 2028. Hayes has a surprise 20% allocation to gold."
        },
        {
            "published_date": "2025-05-18T21:46:10",
            "title": "Himachal calling: Rising cybercrime emerges as major threat in state",
            "author": "Navneet Rathore",
            "url": "https://www.tribuneindia.com/news/himachal/himachal-calling-rising-cybercrime-emerges-as-major-threat-in-himachal-pradesh",
            "url_media": "https://www.tribuneindia.com/sortd-service/imaginary/v22-01/jpg/large/high?url=dGhldHJpYnVuZS1zb3J0ZC1wcm8tcHJvZC1zb3J0ZC9tZWRpYTkwMzY4N2EwLTM0MzEtMTFmMC04NDBiLTBkMWUyZGMyZWRkYi5qcGc=",
            "country": "IN",
            "language": "en",
            "summary": "Himachal Pradesh has been recording 400 complaints of cybercrime every day. People were duped of approximately Rs 114 crore in the past one year by cyber criminals. There was a surge in the number of scam calls between January and April this year. Chief Minister Sukhvinder Singh Sukhu inaugurated 'CY-Station' in the state's capital last year. Several personnel of the state cyber cell have undergone training to become cyber commandos."
        },
        {
            "published_date": "2025-05-18T21:31:33",
            "title": "Crypto millionaires are hiring bodyguards to avoid being kidnapped",
            "author": "Cryptopolitan",
            "url": "https://article.wn.com/view/2025/05/18/Crypto_millionaires_are_hiring_bodyguards_to_avoid_being_kid",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Crypto millionaires are hiring private protection teams as they don't want to be caught off guard when investing in the currency. They have had more inquiries and more long-term clients, and more proactive requests from crypto investors who want to protect their money.  "
        },
        {
            "published_date": "2025-05-18T21:31:09",
            "title": "Crypto elite increasingly worried about their personal safety",
            "author": "Anthony Ha",
            "url": "https://au.finance.yahoo.com/news/crypto-elite-increasingly-worried-personal-213109352.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/GleL5XZOFnB2KRdjQ4BnSQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/techcrunch_350/b3ab247842ad7230a1ff937528d13629",
            "country": "US",
            "language": "en",
            "summary": "Cryptocurrency executives and other investors with significant wealth from crypto holdings are getting more serious about personal security. Recently, three masked men tried to abduct the daughter and granddaughter of the CEO of French currency company Paymium, only to be driven off by the family's neighbors. Last year, Coinbase spent $6.2 million in personal security costs for its CEO Brian Armstrong."
        },
        {
            "published_date": "2025-05-18T21:13:43",
            "title": "To crypto or not to crypto — a personal finance perspective",
            "author": "Yeshiel Panchia",
            "url": "https://www.msn.com/en-za/news/other/to-crypto-or-not-to-crypto-a-personal-finance-perspective/ar-AA1F0Nlt",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "In a recent Money Cents webinar, Business Maverick editor Neesa Moodley chatted to senior journalist Lindsey Schutters about investing in Bitcoin. Bitcoin's core strength isn't yield, it's scarcity. South African Revenue Service treats crypto coins as an intangible asset. "
        },
        {
            "published_date": "2025-05-18T21:05:29",
            "title": "Solana Price Holds $166 Support After Rejection From $183 – What Comes Next?",
            "author": "News BTC",
            "url": "https://article.wn.com/view/2025/05/18/solana_price_holds_166_support_after_rejection_from_183_8211",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Solana (SOL) has struggled to maintain momentum after a rally that saw it peak around the $183 level on May 14. Since then, Solana's price action on the 4-hour chart hasn't given a clear direction, with the cryptocurrency pulling back to $183."
        },
        {
            "published_date": "2025-05-18T21:05:17",
            "title": "Trump Coin dinner to mainly include non-Americans depending on the best holders",
            "author": "News Desk",
            "url": "https://exbulletin.com/politics/3040423",
            "url_media": "https://i0.wp.com/image.cnbcfm.com/api/v1/image/108140918-1746451285527-gettyimages-2198663023-raa-donaldtr250213_npNrt.jpeg?resize=1000%2C600&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "On May 22, the 220 Top 220 Trump Top 220 were invited to a dinner with the president of his Virginia Golf Club outside Washington. Many of the holders of TOP 275 Trump chips are linked to international exchanges like Binance. 19 of the 25 best portfolios belong to individuals operating outside the United States. Senator Richard Blumenthal, D-Conn., warned that growing assets of the Trump family could serve as a stolen door for foreign and business interests seeking access to the president."
        },
        {
            "published_date": "2025-05-18T21:00:07",
            "title": "Bitcoin (BTC) Climbs to $103.065 in a Month, But Ruvi AI (RUVI) Redefines Investing by Offering 100% Early Bonus and 20,000% Growth Potential",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/other/bitcoin-btc-climbs-to-103-065-in-a-month-but-ruvi-ai-ruvi-redefines-investing-by-offering-100-early-bonus-and-20-000-growth-potential/ar-AA1F0OrD",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Ruvi is a project that brings AI technology and the blockchain together in a platform aimed at empowering content creators. Phase 1 of the presale sold out in just over two weeks. Early adopters enjoyed impressive 50% gains. Ruvi tokens are set for a 0.33% price increment in the next phase."
        },
        {
            "published_date": "2025-05-18T20:27:00",
            "title": "Cassie Craven: Wyoming's Stable Token Is In A Race",
            "author": "",
            "url": "https://cowboystatedaily.com/2025/05/18/cassie-craven-wyomings-stable-token-is-in-a-race",
            "url_media": "https://cowboystatedaily.imgix.net/cassie-craven-8-22-24.jpg",
            "country": "US",
            "language": "en",
            "summary": "The prospective buyer of Tik Tok, Reid Rasner from Casper, Wyoming spoke with lawmakers this week about Wyoming's new 'stable token' - a digital asset or cryptocurrency minted on a blockchain network. It's the first of its kind in the nation and is in a race with the federal government to see who can get it stood up first. Rasner hopes that Wyoming's stable token will be integrated into Tik Tok but liquidity will be the biggest issue. It needs enough assets to guarantee $1 trillion and is backed by the U.S. dollar."
        },
        {
            "published_date": "2025-05-18T20:15:18",
            "title": "Solana, Dogecoin, and SHIBA INU Are Trending Again — Could This Be the Start of the Meme Coin Supercycle?",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/markets/solana-dogecoin-and-shiba-inu-are-trending-again-could-this-be-the-start-of-the-meme-coin-supercycle/ar-AA1F0Sim",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Solana, Dogecoin and SHIBA INU coins have experienced increased trading activity and attention. MAGACOIN FINANCE is gaining traction on smaller forums and is attracting the attention of new investors. The volume the last 24 hours has been $1.32 billion."
        },
        {
            "published_date": "2025-05-18T20:15:15",
            "title": "Ethereum and Dogecoin Show Strength, but Web3 ai's 1747% ROI Positions It as a Top Crypto Investment",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/other/ethereum-and-dogecoin-show-strength-but-web3-ai-s-1747-roi-positions-it-as-a-top-crypto-investment/ar-AA1F0Xje",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Ether (ETH) is moving back toward $2,500. Dogecoin (DOGE) is consolidating near $0.2135. Web3 ai is an AI-powered investment platform currently in presale with a 1747% projected ROI and over $4.1 million raised."
        },
        {
            "published_date": "2025-05-18T20:15:00",
            "title": "7 Top New Meme Coins to Invest in This Month – Mog Coin, Neiro, and a Presale Rocking Charts",
            "author": "Tribune Online",
            "url": "https://tribuneonlineng.com/7-top-new-meme-coins-to-invest-in-this-month-mog-coin-neiro-and-a-presale-rocking-charts",
            "url_media": "https://tribuneonlineng.com/wp-content/uploads/2025/05/image-112.png",
            "country": "NG",
            "language": "en",
            "summary": "Meme coins like Trollercat, Mog Coin, Neiro, Notcoin, Book of Meme, Turbo, and Memecoin are growing in popularity. Troller Cat ($TCAT) is making waves with its innovative presale structure and substantial community engagement. Neiro brings a futuristic twist to meme coins by integrating AI to optimize its blockchain utility."
        },
        {
            "published_date": "2025-05-18T20:00:39",
            "title": "If GPT 4o and Binance Had a Baby, It'd Look Like Unilabs Presale",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/topstocks/if-gpt-4o-and-binance-had-a-baby-it-d-look-like-unilabs-presale/ar-AA1F0Q6M",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Unilabs has raised over $490,000 in two stages of its presale. It's backed by $30M in AUM. The platform uses AI to scan the crypto market 24/7 and ranks upcoming projects using EASS. It also tracks the fastest-growing meme coins by using its Memecoin Identification Tool. Holders earn up to 30% of the platform's profit by referring others to the platform."
        },
        {
            "published_date": "2025-05-18T19:53:29",
            "title": "Top cryptocurrencies to watch this week: Trump Coin, XRP, Zetachain",
            "author": "BTC Manager",
            "url": "https://article.wn.com/view/2025/05/18/Top_cryptocurrencies_to_watch_this_week_Trump_Coin_XRP_Zetac",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Cryptocurrency prices retreated last week after Bitcoin failed to move above the $1,000 mark. Bitcoin is now back below $1.00.    - Bitcoin's value has not moved above $1000 in the last week's trading session. "
        },
        {
            "published_date": "2025-05-18T19:35:12",
            "title": "The UK requires that cryptocurrency companies report all customer transactions.",
            "author": "News Desk",
            "url": "https://exbulletin.com/world/international/3040367",
            "url_media": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2025-01/01944d34-90f1-7174-97be-18db51bfbf3c",
            "country": "US",
            "language": "en",
            "summary": "The British government wants to collect and report data from all customer transactions and transfer from January 1, 2026 as part of a wide range of efforts to improve cryptographic tax reporting. The new rule is part of the UKS integration cryptoasset report framework of the economic development organization. "
        },
        {
            "published_date": "2025-05-18T19:25:16",
            "title": "The Africrypt files, Part 2 — The Cajee brothers' ‘escape' plan",
            "author": "Yeshiel Panchia",
            "url": "https://www.dailymaverick.co.za/article/2025-05-18-the-africrypt-files-part-2-the-cajee-brothers-escape-plan",
            "url_media": "https://i0.wp.com/www.dailymaverick.co.za/wp-content/uploads/2025/05/P17-yesh-africrooks.jpg?fit=1280%2C640&quality=89&ssl=1",
            "country": "ZA",
            "language": "en",
            "summary": "Raees and Ameer Cajee left South Africa within weeks of the email claiming that Africrypt's wallets had been compromised. They used Vanuatu-issued passports during their post-exit international travel. They travelled to the UK, Dubai, Turkey, Zurich, Qatar, Turkey and the UAE. They are being investigated on suspicion of money laundering in Switzerland."
        },
        {
            "published_date": "2025-05-18T19:19:30",
            "title": "Bitcoin Price Eyes $110,000 As Michael Saylor Hints At Another Strategy Purchase",
            "author": "Coin Gape",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Price_Eyes_110000_As_Michael_Saylor_Hints_At_Another",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Michael Saylor has sent ripples through the cryptoverse after flashing a Bitcoin buying indicator for Strategy (formerly MicroStrategy). The incoming purchase may be an inflection point for Bitcoin price in its push to surpass its previous value.    .   i"
        },
        {
            "published_date": "2025-05-18T19:19:30",
            "title": "Coinbase Hack: Crypto Millionaires Hire Bodyguards Following Data Breach",
            "author": "Coin Gape",
            "url": "https://article.wn.com/view/2025/05/18/Coinbase_Hack_Crypto_Millionaires_Hire_Bodyguards_Following_",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Coinbase hack exposed customer home addresses and account balances to hackers. Wealthy cryptocurrency investors are increasingly turning to professional security services following the hack. The security concerns come amid a troubling time for the cryptocurrency industry.       - The company has had more inquiries, more long-term clients and more proactive requests. "
        },
        {
            "published_date": "2025-05-18T19:15:13",
            "title": "Top Rated Crypto 2025: Why Qubetics, XRP, and Aptos Lead the Blockchain Revolution",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/smallbusiness/top-rated-crypto-2025-why-qubetics-xrp-and-aptos-lead-the-blockchain-revolution/ar-AA1F0EoH",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Recent developments in the cryptocurrency market have shifted focus toward projects that promise practical solutions and strong interoperability across ecosystems. Qubetics, XRP, Aptos, and Ripple are some of the top rated assets shaping the future of the digital finance industry. "
        },
        {
            "published_date": "2025-05-18T19:00:19",
            "title": "Cardano (ADA) Surges by 22% in a Month, But Analysts Are Bullish On Ruvi AI (RUVI) To Reach $2.00 and Turn $500 into $140,000",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/other/cardano-ada-surges-by-22-in-a-month-but-analysts-are-bullish-on-ruvi-ai-ruvi-to-reach-2-00-and-turn-500-into-140-000/ar-AA1F0Pqe",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Ruvi is an AI-driven decentralized superapp that offers strategic investment opportunities with impressive returns. Ruvi's market debut sold out in just over two weeks, rewarding early participants with a 50% return. Analysts foresee a future valuation of $1 per Ruvi token."
        },
        {
            "published_date": "2025-05-18T19:00:00",
            "title": "Dreamworld founder's Hinterland retreat hits the market",
            "author": "Viva Hyde",
            "url": "https://www.news.com.au/finance/real-estate/dreamworld-founders-hinterland-retreat-hits-the-market/news-story/fd3144e14243b1fe73f4dd7d0f3df874",
            "url_media": "https://content.api.news/v3/images/bin/c2b997a00626fc413c22ffbdd6abed65",
            "country": "AU",
            "language": "en",
            "summary": "Dreamworld founder John Longhurst built a holiday home in Tamborine Mountain for $2.3m in 2010. He died in 2022 aged 90. The house was last sold for $5.025m in 2021 to a crypto-trading family from New Zealand. It's on the market for $1.015m. "
        },
        {
            "published_date": "2025-05-18T18:59:26",
            "title": "Could Alternative Cryptos Outperform Bitcoin in the Next Market Cycle? Analysts Highlight Five to Watch in 2025",
            "author": "The Tribune",
            "url": "https://www.tribuneindia.com/partner-exclusives/could-alternative-cryptos-outperform-bitcoin-in-the-next-market-cycle-analysts-highlight-five-to-watch-in-2025",
            "url_media": "https://www.tribuneindia.com/sortd-service/imaginary/v22-01/jpg/large/high?url=dGhldHJpYnVuZS1zb3J0ZC1wcm8tcHJvZC1zb3J0ZC9tZWRpYTNkNGIzYjYwLTM0MWEtMTFmMC04NDBiLTBkMWUyZGMyZWRkYi5qcGc=",
            "country": "IN",
            "language": "en",
            "summary": "As the cryptocurrency market looks toward its next significant upswing, focus is shifting from Bitcoin to other promising digital assets. Experts suggest that five alternative coins could drive exceptional growth by 2025. The XYZVerse project merges the worlds of sports and crypto. BNB is the native cryptocurrency at the heart of Binance's ecosystem. Tron is a platform that aims to change how we share and reward digital content."
        },
        {
            "published_date": "2025-05-18T18:53:28",
            "title": "What's the best Crypto to buy as ETH starts Altcoin season",
            "author": "Invezz",
            "url": "https://article.wn.com/view/2025/05/18/What_s_the_best_Crypto_to_buy_as_ETH_starts_Altcoin_season",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Euromutable's 4.8% gain in one day heralds the start of a thriving altcoin season as it approaches the $3,000 milestone. There has been a 39% increase in trading volume on the cryptocurrency market since Monday. "
        },
        {
            "published_date": "2025-05-18T18:46:27",
            "title": "Germany's BaFIN grants crypto license to Trade Republic amid slow MiCA rollout",
            "author": "Cryptopolitan News",
            "url": "https://www.msn.com/en-us/money/markets/germany-s-bafin-grants-crypto-license-to-trade-republic-amid-slow-mica-rollout/ar-AA1F0FWi",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Trade Republic has secured a full license from Germany's financial regulator BaFIN to offer crypto services. It is the latest company to get licensed under the Market in Crypto Assets (MiCA) framework. 25 companies have now gotten licenses under the MiCA framework. The transition period for the unifying crypto regulation for Europe is expected to end by the start of July 2026."
        },
        {
            "published_date": "2025-05-18T18:45:40",
            "title": "Solana and XRP Experience Whale Outflows as Low-Cap Token Sees Increased Wallet Activity",
            "author": "The Tribune",
            "url": "https://www.tribuneindia.com/partner-exclusives/solana-and-xrp-experience-whale-outflows-as-low-cap-token-sees-increased-wallet-activity",
            "url_media": "https://www.tribuneindia.com/sortd-service/imaginary/v22-01/jpg/large/high?url=dGhldHJpYnVuZS1zb3J0ZC1wcm8tcHJvZC1zb3J0ZC9tZWRpYTUwYzE0YmYwLTM0MTgtMTFmMC04NDBiLTBkMWUyZGMyZWRkYi5qcGc=",
            "country": "IN",
            "language": "en",
            "summary": " XYZVerse project merges the worlds of sports and crypto. The project was recently recognized as Best NEW Meme Project. More than $13 million has been raised and the presale is approaching another milestone of $15 million. Solana (SOL) has been on the move recently. In the past week, its price jumped by 16.11%. Over the past month, it surged 32.21%."
        },
        {
            "published_date": "2025-05-18T18:34:00",
            "title": "Top Crypto Presales to Watch Right Now — Before the Market Runs Again",
            "author": "ISAAC KAPLAN",
            "url": "https://www.jpost.com/crypto-currency/article-854465",
            "url_media": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/663877",
            "country": "IL",
            "language": "en",
            "summary": "Kaanch Network is a high-speed, cross-chain Layer 1 currently in Stage 5 of its presale, with a price of just $0.16. Its core selling point is infrastructure that solves real problems, not hype. Kaanch is still early, underexposed and offering utility that rivals blockchains already in the top 50 by market cap."
        },
        {
            "published_date": "2025-05-18T18:21:24",
            "title": "Bitcoin Price Suddenly Soars As Congress Predicted To ‘Make History'",
            "author": "Forbes",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Price_Suddenly_Soars_As_Congress_Predicted_To_Make_H",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "JPMorgan analysts switched their focus from gold to bitcoin. They predict the bitcoin price will outperform gold over the rest of the 2025.      Â   - JPMorgan analysts  - Bitcoin price will outstrip gold price over the next 25 years."
        },
        {
            "published_date": "2025-05-18T18:19:31",
            "title": "China debuts world's first quantum cryptography system, claims it's ‘unhackable'",
            "author": "Bojan Stojkovski",
            "url": "https://www.msn.com/en-us/money/other/china-debuts-world-s-first-quantum-cryptography-system-claims-it-s-unhackable/ar-AA1F0KEq",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The China Telecom Quantum Group announced the launch of the world's first distributed cryptography system that combines quantum mechanics and Post-Quantum Cryptography to protect data using complex mathematical algorithms. The company also completed the first cross-regional quantum-encrypted phone call covering a distance of more than 600 miles between Beijing and Hefei. China Telecom has established quantum metropolitan area networks in 16 major Chinese cities. It serves 500 government agencies and 380 state-owned enterprises."
        },
        {
            "published_date": "2025-05-18T18:19:22",
            "title": "China unveils world's first ‘unhackable' quantum cryptography system",
            "author": "Bojan Stojkovski",
            "url": "https://interestingengineering.com/innovation/china-world-first-unhackable-quantum-cryptography-system",
            "url_media": "https://cms.interestingengineering.com/wp-content/uploads/2025/05/iStock-13586258401.jpg",
            "country": "US",
            "language": "en",
            "summary": "The China Telecom Quantum Group announced last week the launch of the world's first distributed cryptography system that combines two core technologies. The company also completed the first cross-regional quantum-encrypted phone call covering a distance of more than 600 miles between Beijing and Hefei. China Telecom has established quantum metropolitan area networks in 16 major Chinese cities. The network serves 500 government agencies and 380 state-owned enterprises."
        },
        {
            "published_date": "2025-05-18T18:11:56",
            "title": "Next Crypto to hit $1: Mutuum Finance challenges Dogecoin and Shiba Inu, who will come out on top?",
            "author": "Collaborations",
            "url": "https://news.knowledia.com/all/all/articles/next-crypto-to-hit-1-mutuum-finance-challenges-dogecoin-and-shiba-inu-52a0c3ae594d119e0ed7676ec329c9d87e72c170",
            "url_media": "https://invezz.com/wp-content/uploads/2025/05/Mutuum-Finance-challenges-Dogecoin-and-Shiba-Inu-1024x574.png",
            "country": "FR",
            "language": "en",
            "summary": "Mutuum Finance has raised more than $8.6 million and attracted over 10,000 participants. The presale for phase 4 is almost closing and investors stand to make up to 140% in profit once the launch price of $0.06 is reached. Mutum Finance is backed by real-world functionality, efficient tokenomics, and growing community support."
        },
        {
            "published_date": "2025-05-18T18:11:56",
            "title": "What's the best Crypto to buy as ETH starts Altcoin season",
            "author": "Collaborations",
            "url": "https://news.knowledia.com/all/all/articles/what-s-the-best-crypto-to-buy-as-eth-starts-altcoin-season-0b216f84b107d7aaf1b791ba3999b1394f55b0c2",
            "url_media": "https://invezz.com/wp-content/uploads/2025/05/Best-crypto-to-buy-1024x574.png",
            "country": "FR",
            "language": "en",
            "summary": "Mutuum Finance (MUTM) has raised $8,600,000 and sold over 481 million tokens to 10,000 holders. Mutuum Finance is a decentralised financial enterprise that captivates investors. The Pectra upgrade has boosted the value of Etherium."
        },
        {
            "published_date": "2025-05-18T18:11:56",
            "title": "5 top Altcoins to buy in May 2025: XRP, Solana and more",
            "author": "Collaborations",
            "url": "https://news.knowledia.com/all/all/articles/5-top-altcoins-to-buy-in-may-2025-xrp-solana-and-more-3d376f206878a29e6af8726db4d651e2e8c09f86",
            "url_media": "https://invezz.com/wp-content/uploads/2025/05/5-altcoins-to-buy-1024x574.png",
            "country": "FR",
            "language": "en",
            "summary": "May 2025 is shaping up to be a pivotal moment for altcoin investors as market momentum builds and crypto prices start flashing bullish signals. New coin Mutuum Finance (MUTM) is currently in Presale Phase 4 which is over 80% sold out, already raking in over $8.6 million with over 10,000 investors participating."
        },
        {
            "published_date": "2025-05-18T18:11:56",
            "title": "Best Crypto to invest in: Experts back ADA, MUTM and DOGE",
            "author": "Collaborations",
            "url": "https://news.knowledia.com/all/all/articles/best-crypto-to-invest-in-experts-back-ada-mutm-and-doge-cfcdf90240968441305599715221baea1996b1af",
            "url_media": "https://invezz.com/wp-content/uploads/2025/05/Experts-back-ADA-MUTM-and-DOGE-1024x574.png",
            "country": "FR",
            "language": "en",
            "summary": "Cardano (ADA), Mutuum Finance (MUTM), and Dogecoin (DOGE) are being highlighted as the best cryptocurrencies to purchase right now due to a surge in investor interest. Experts estimate that strong fundamentals and market momentum might propel these currencies to 500% gains in 2025."
        },
        {
            "published_date": "2025-05-18T18:11:56",
            "title": "Top crypto price predictions: Onyxcoin (XCN), Dogwifhat (WIF), Litecoin",
            "author": "Crispus Nyaga",
            "url": "https://news.knowledia.com/all/all/articles/top-crypto-price-predictions-onyxcoin-xcn-dogwifhat-wif-litecoin-509557431ca196619fc2a46da091acdd297ddc55",
            "url_media": "https://invezz.com/wp-content/uploads/2025/05/Crypto-1024x640.png",
            "country": "FR",
            "language": "en",
            "summary": "The market cap of all cryptocurrencies has dropped by over 3% in the last few days to $3 trillion. Bitcoin has stagnated below $105,000. Onyxcoin token has moved from obscurity into one of the best-performing players in the crypto industry."
        },
        {
            "published_date": "2025-05-18T18:11:56",
            "title": "If you're wondering what crypto to buy before the market picks up, MUTM shouldn't be ignored",
            "author": "Collaborations",
            "url": "https://news.knowledia.com/all/all/articles/if-you-re-wondering-what-crypto-to-buy-before-the-market-picks-up-mutm-813fce8038fad235c4dd67cfdaa9155f89799d5c",
            "url_media": "https://invezz.com/wp-content/uploads/2025/05/MUTM-a-crypto-that-shouldnt-be-ignored-1024x574.png",
            "country": "FR",
            "language": "en",
            "summary": "Mutuum Finance (MUTM) is in pre-sale and priced at $0.025. The project is focused on decentralized lending and borrowing. Users interact with the system by depositing assets and borrowing funds. Borrowers pay interest. A portion of that interest is used to buy back MUTM tokens on the open market."
        },
        {
            "published_date": "2025-05-18T18:06:19",
            "title": "Interoperability and Ecosystem Growth: The Combined Strength of Oraichain, Pinlink, and RSS3",
            "author": "AMBCrypto Team",
            "url": "https://news.knowledia.com/all/all/articles/interoperability-and-ecosystem-growth-the-combined-strength-of-1a9fd7d3b85a093115f54ee657d5ec7f7bd606dd",
            "url_media": "https://ambcrypto.com/wp-content/uploads/2025/05/guerrillabuzz-RIvSJTiGwLc-unsplash-1000x600.jpg",
            "country": "FR",
            "language": "en",
            "summary": "A truly robust Web3 cannot exist in silos. Its strength lies in the interoperability and growth of diverse platforms and protocols. Oraichain, Pinlink, and RSS3 exemplify this collaborative spirit. They are designed to contribute to a more connected and efficient decentralized web in May 2025."
        },
        {
            "published_date": "2025-05-18T18:06:19",
            "title": "From Vision to Reality: Oraichain, Pinlink, and RSS3 Building a User-Centric Web",
            "author": "AMBCrypto Team",
            "url": "https://news.knowledia.com/all/all/articles/from-vision-to-reality-oraichain-pinlink-and-rss3-building-a-f03dca8906287691e5d0207615e6929e8331f9ce",
            "url_media": "https://ambcrypto.com/wp-content/uploads/2025/05/guerrillabuzz-MqH5ObZMG6A-unsplash-1000x600.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Oraichain's AI Layer 1 platform and oracle services ensure that the AI integrated into decentralized applications is transparent and its operations are auditable. This gives users interacting with AI-powered DApps greater confidence in the fairness and reliability of the underlying logic, a critical aspect for mainstream adoption."
        },
        {
            "published_date": "2025-05-18T18:06:19",
            "title": "The Backbone of Next-Gen AI: Oraichain, Pinlink, and RSS3's Synergistic Roles",
            "author": "AMBCrypto Team",
            "url": "https://news.knowledia.com/all/all/articles/the-backbone-of-next-gen-ai-oraichain-pinlink-and-rss3-s-synergistic-c82266213b770c1679dc5fec17ddf8982765bdcd",
            "url_media": "https://ambcrypto.com/wp-content/uploads/2025/05/mariola-grobelska-jiB-8AGyFAA-unsplash-1000x600.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Oraichain provides the critical layer of trust and verifiable computation for AI in decentralized systems. It enables developers to build and deploy AI models whose operations are transparent and auditable on-chain. Its AI Marketplace fosters innovation by allowing AI providers to offer their services while test cases ensure data quality."
        },
        {
            "published_date": "2025-05-18T18:06:19",
            "title": "Binance coin: Spot vs. Futures traders – Who's in control of BNB's price?",
            "author": "Olayiwola Dolapo",
            "url": "https://news.knowledia.com/all/all/articles/binance-coin-spot-vs-futures-traders-who-s-in-control-of-bnb-s-price-08ca5b73b1eb9fdbd3d4c171d8b778cf15dd735f",
            "url_media": "https://ambcrypto.com/wp-content/uploads/2025/05/368198EF-4CCF-4B85-8A47-11DF4D07814B-1000x600.webp",
            "country": "FR",
            "language": "en",
            "summary": "BNB price rose 0.10% in 24 hours. Short traders lost over $102K. Spot traders are taking the bullish position. $8.34 million worth of BNB moved off exchanges in the last day, bringing the week's net outflow to $31.28 million."
        },
        {
            "published_date": "2025-05-18T18:06:19",
            "title": "Equities rip higher as Bitcoin gets left behind – A new market reality to watch!",
            "author": "Ritika Gupta",
            "url": "https://news.knowledia.com/all/all/articles/equities-rip-higher-as-bitcoin-gets-left-behind-a-new-market-reality-to-0e51ce42faa7ec82141851038fdbb813a9037d6f",
            "url_media": "https://ambcrypto.com/wp-content/uploads/2025/05/Ritika6-1-1-1000x600.webp",
            "country": "FR",
            "language": "en",
            "summary": "The U.S. dollar index dropped 11%, which is boosting risk assets. Bitcoin retail holders have been bleeding out, shedding 247,000 BTC year-to-date, equivalent to a $25.7 billion sell-off in spot terms. Businesses scooped up over 157,000 Bitcoin."
        },
        {
            "published_date": "2025-05-18T18:06:19",
            "title": "Economic Incentives and Token Utility: Driving Participation in Oraichain, Pinlink, and RSS3",
            "author": "AMBCrypto Team",
            "url": "https://news.knowledia.com/all/all/articles/economic-incentives-and-token-utility-driving-participation-in-f9e58e606a5f3808b5083683a125b76aaf25ddab",
            "url_media": "https://ambcrypto.com/wp-content/uploads/2025/05/chris-briggs-VK7jXtOtEuM-unsplash-1000x600.jpg",
            "country": "FR",
            "language": "en",
            "summary": "As of May 2025, Oraichain, Pinlink and RSS3 will issue ORAI tokens. ORAi is the lifeblood of their AI Layer 1 and oracle ecosystem. It pays for transaction fees when users request AI services or interact with DApps. It also secures the network and ensures the integrity of AI computations. It grants token holders governance rights to vote on protocol upgrades."
        },
        {
            "published_date": "2025-05-18T18:06:19",
            "title": "FARTCOIN traders turn cautious! – A 45% dip could be on the horizon IF…",
            "author": "Vivaan Acharya",
            "url": "https://news.knowledia.com/all/all/articles/fartcoin-traders-turn-cautious-a-45-dip-could-be-on-the-horizon-if-1bba7846e0ee44c0ab13d988bf5f9a82a748f8bb",
            "url_media": "https://ambcrypto.com/wp-content/uploads/2025/05/Chandan-2025-05-18T150351.729_11zon-1000x600.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Fartcoin traded near $1.27 after an 8.5% daily gain, but volume dropped 35% as traders backed off. Spot Inflows hit $225.78K, suggesting holders may be preparing to exit following the meme coin's parabolic run."
        },
        {
            "published_date": "2025-05-18T18:06:19",
            "title": "Bitcoin traders are back in profit, but are they ignoring THESE warning signs?",
            "author": "Erastus Chami",
            "url": "https://news.knowledia.com/all/all/articles/bitcoin-traders-are-back-in-profit-but-are-they-ignoring-these-warning-713917d53db1029cfcd8b3a13323c7cf562149ee",
            "url_media": "https://ambcrypto.com/wp-content/uploads/2025/05/Erastus-2025-05-18T101555.877-1-1000x600.png",
            "country": "FR",
            "language": "en",
            "summary": "Bitcoin's Stock-to-Flow Ratio dropped by 16.66%, reflecting reduced scarcity from increased miner or holder distribution. Short-term holders' Profit/Loss Margin jumped from -19% in April to +21% in May. Realized Price for the 1-3 month cohort has stabilized at $84,600. Network Value to Transaction (NVT) ratio climbed by nearly 70% to hit 52.81%."
        },
        {
            "published_date": "2025-05-18T18:00:05",
            "title": "Unstaked Racing Ahead With Over $6M Raised: Will It Leave Aptos and Stellar Behind in 2025?",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/markets/unstaked-racing-ahead-with-over-6m-raised-will-it-leave-aptos-and-stellar-behind-in-2025/ar-AA1F0yvB",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Unstaked raised over $6 million in presale funding and has a strong real-world use case. Aptos had a rough week after unlocking over $65 million worth of tokens, pushing its price below the key $6 support level. Stellar recently broke free from a long-term correction pattern, sparking a rally that took its price above $0.32."
        },
        {
            "published_date": "2025-05-18T17:58:52",
            "title": "Qatar, Turkiye urged consider joint sukuk issuance and cross-listing on Borsa Istanbul and QSE",
            "author": "Santhosh V. Perumal",
            "url": "https://www.gulf-times.com/article/704820/business/qatar-turkiye-urged-consider-joint-sukuk-issuance-and-cross-listing-on-borsa-istanbul-and-qse",
            "url_media": "https://www.gulf-times.com/gulftimes/uploads/images/2025/05/18/thumbs/300x300/317955.jpg",
            "country": "QA",
            "language": "en",
            "summary": "Ankara and Doha need to consider joint issuance of sukuks and their cross-listing on Borsa Istanbul and the Qatar Stock Exchange. Turkiye has a well-established sukuk market, ranking fifth globally in the past five years. Fintech and digital Islamic banking are also set to play a crucial role in shaping the future of financial collaboration."
        },
        {
            "published_date": "2025-05-18T17:32:32",
            "title": "XRP News: XenDex Presale Still Ongoing While Preparing For Its First Security Audit, Buy $XDX Before Listing On Exchanges",
            "author": "",
            "url": "https://apnews.com/press-release/globenewswire-mobile/xrp-news-xendex-presale-still-ongoing-while-preparing-for-its-first-security-audit-buy-xdx-before-listing-on-exchanges-367ecb78fafd19c57cc82e77ebdfc0a8",
            "url_media": "https://dims.apnews.com/dims4/default/bef9dec/2147483647/strip/true/crop/600x338+0+1/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2F23%2F093c0ec82935907d6994e07d173f%2Fa56bf573b405ad1010d9f1e49cc128f3",
            "country": "US",
            "language": "en",
            "summary": "XenDex is developing the first all-in-one decentralized exchange (DEX) on XRPL. The soft cap on the presale for the $XDX token has already been filled and the hard cap is nearly complete. The presale ends on May 18th, but there's still time to secure tokens before listings and price hikes."
        },
        {
            "published_date": "2025-05-18T17:30:00",
            "title": "eBay: Rare Beatrix Potter coin selling at over £5,000",
            "author": "Mins Ago",
            "url": "https://www.swindonadvertiser.co.uk/news/25172270.ebay-rare-beatrix-potter-coin-selling-5-000",
            "url_media": "https://www.swindonadvertiser.co.uk/resources/images/19468657.jpg?type=og-image&xType=0&yType=85",
            "country": "GB",
            "language": "en",
            "summary": "The 2017 Beatrix Potter Benjamin Bunny UK 50p coin has been listed on eBay for £5,086.72. The coin commemorates the author of The Tale of Peter Rabbit. It can be collected in person from the seller in Swindon or delivered for £8.35."
        },
        {
            "published_date": "2025-05-18T17:22:26",
            "title": "XRP News: XenDex Currently In Its last Presale Phase As Users Expect Its First DEX Launch And Exchange Listing, Join Presale As XRP Price Keeps Going Up",
            "author": "",
            "url": "https://apnews.com/press-release/globenewswire-mobile/telegram-cdbc09f4737708848097bda3927d81e5",
            "url_media": "https://dims.apnews.com/dims4/default/a000651/2147483647/strip/true/crop/600x338+0+1/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2Fb2%2Ffb919cf83a3b6cf1b50cad6febf5%2F5a181900f516cafc44b74f70e0ab956f",
            "country": "US",
            "language": "en",
            "summary": "XenDex is the first all-in-one DEX on XRPL. The final phase of the $XDX presale is underway. The soft cap has been filled and the hard cap is nearly reached. It's the last chance to buy $X DX before major exchange listings go live. "
        },
        {
            "published_date": "2025-05-18T17:16:00",
            "title": "Rich Dad Poor Dad author shared many predictions but only one has come true",
            "author": "Mehab Qureshi",
            "url": "https://finance.yahoo.com/news/rich-dad-poor-dad-author-171600971.html",
            "url_media": "https://media.zenfs.com/en/thestreet_881/584fedab70f8f083806e9b9935874ceb",
            "country": "US",
            "language": "en",
            "summary": "Robert Kiyosaki, author of Rich Dad Poor Dad, predicted Bitcoin would reach $100,000 in November 2024. Bitcoin is trading around $103,278 this month. He has been warning about the financial system for years and pointed to assets like gold, silver and Bitcoin as the escape route."
        },
        {
            "published_date": "2025-05-18T17:13:20",
            "title": "$25T Shiba Inu Trapped: Market Downturn Impact – Archyde: Latest World News, Economy, Entertainment, Health, Technology & Sports Updates",
            "author": "archyde",
            "url": "http://www.archyde.com/25t-shiba-inu-trapped-market-downturn-impact",
            "url_media": "https://cdn.benzinga.com/files/images/story/2025/05/18/Shiba-Inu-Coin-On-The-Red-Sateen-Backgro.jpeg?width=1200&height=800&fit=crop",
            "country": "US",
            "language": "en",
            "summary": "Shiba Inu (SHIB) is a popular meme coin. Recent market volatility has raised questions about its future value. Market analysis reveals a significant amount of SHIB tokens held within a narrow price range, leading to speculation that these tokens are 'stuck'. This makes accurate Shiba inu price prediction a complex task."
        },
        {
            "published_date": "2025-05-18T17:05:16",
            "title": "Next Crypto to hit $1: Mutuum Finance challenges Dogecoin and Shiba Inu, who will come ...",
            "author": "Invezz",
            "url": "https://article.wn.com/view/2025/05/18/Next_Crypto_to_hit_1_Mutuum_Finance_challenges_Dogecoin_and_",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Mutuum Finance and meme coin are going head-to-head in the race to the $1 milestone. The market is known for dramatic comebacks and unexpected winners. Mutuum Finance is a rising DeFi powerhouse. Meme coin is a meme coin."
        },
        {
            "published_date": "2025-05-18T16:58:38",
            "title": "Bitcoin Nears Golden Cross Weeks After 'Trapping Bears' as U.S. Debt Concerns Mount",
            "author": "Omkar Godbole",
            "url": "https://finance.yahoo.com/news/bitcoin-nears-golden-cross-weeks-165838206.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/Q99VcoKVsP8I1ywNVySa1g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://media.zenfs.com/en/coindesk_75/984bafece30903ecda52e5cab4544e18",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin's price chart is following a bullish pattern that foreshadowed the late 2024 price surge from $70,000 to $100,000. The leading cryptocurrency by market value is on track to confirm a \"golden cross\" in the coming days. The macro factors seem aligned with the bullish technical setup. Moody's downgraded the U.S. sovereign credit rating from the highest 'Aaa' to 'Aa1'."
        },
        {
            "published_date": "2025-05-18T16:56:25",
            "title": "Bitcoin Price Suddenly Soars As Congress Predicted To ‘Make History'",
            "author": "Billy Bambrough",
            "url": "https://www.forbes.com/sites/digital-assets/2025/05/18/jpmorgan-just-flipped-on-bitcoin-issues-huge-new-2025-price-prediction",
            "url_media": "https://imageio.forbes.com/specials-images/imageserve/6828555126e7d2e0b3b066ef/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
            "country": "US",
            "language": "en",
            "summary": "JPMorgan analysts predict the bitcoin price will outperform gold over the rest of 2025. A bill that would regulate stablecoin issuers will be debated by Congress this week. The bill has been redrafted to satisfy Democrats concerned with consumer protection and national security elements."
        },
        {
            "published_date": "2025-05-18T16:47:19",
            "title": "XRP News: As Ripple's Price Eyes Breakout, $XRT Surges 150% Launches Liquid Staking On XRPL",
            "author": "",
            "url": "https://apnews.com/press-release/globenewswire-mobile/financial-markets-7096d206ee68cfd96d3d8f386f0c784d",
            "url_media": "https://dims.apnews.com/dims4/default/e373ba4/2147483647/strip/true/crop/556x313+22+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F42%2F22%2F018f0a6d5d2719e14e2b306034ec%2Fa5733c00c726824888b18b01d2e2af80",
            "country": "US",
            "language": "en",
            "summary": "XRT token is now trading on BitMart and Xpmarket as Xrpturbo's liquid staking is live. The platform's native token XRT has surged by nearly 150% on exchanges since its presale concluded. Governance & Launchpad DApp is rolling out soon on the XRPL Testnet."
        },
        {
            "published_date": "2025-05-18T16:36:44",
            "title": "'This is the mafia' — How North Korea structures its IT workers like an organized crime syndicate",
            "author": "Amanda Gerut",
            "url": "https://news.knowledia.com/all/all/articles/this-is-the-mafia-how-north-korea-structures-its-it-workers-like-an-f810762059082924139144d82973810afcb63c97",
            "url_media": "https://fortune.com/img-assets/wp-content/uploads/2025/05/GettyImages-2157765734-e1747447137980.jpg",
            "country": "FR",
            "language": "en",
            "summary": "The North Korean IT workers scheme rakes in $250 million to $600 million per year and billions in crypto, according to UN estimates. Amanda Gerut explains how North Korea structures its IT workers like an organized crime syndicate to Fortune.com.  "
        },
        {
            "published_date": "2025-05-18T16:20:08",
            "title": "Expert Downplay Cardano and Dogecoin For Big Gains In 2025 & Point To XRP Rival Eyeing 13,000% ROI",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/markets/expert-downplay-cardano-and-dogecoin-for-big-gains-in-2025-point-to-xrp-rival-eyeing-13-000-roi/ar-AA1F0jJO",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Remittix (RTX) is a PayFi contender aiming to disrupt global payments at lightning speed. Remittix has a 13,000% ROI and over 89% of tokens sold and $15 million raised. Dogecoin (DOGE) surged 31% in a week to $0.22, but experts aren't convinced it has staying power."
        },
        {
            "published_date": "2025-05-18T16:12:00",
            "title": "Cebu Landmasters readying mobile app",
            "author": "Earl John Alfaro",
            "url": "https://www.manilatimes.net/2025/05/19/business/corporate-news/cebu-landmasters-readying-mobile-app/2116023",
            "url_media": "https://cdn4.premiumread.com/?url=https://www.manilatimes.net/theme_manilatimes/images/TMT_1920x1008.jpg&w=1920&q=100&f=webp&v=1",
            "country": "PH",
            "language": "en",
            "summary": "Developer Cebu Landmasters Inc. is planning to launch a mobile app that will allow property buyers to download their statements of account, make seamless payments and even reserve units online. It is said to be part of the company's digital transformation efforts under a broader strategy to strengthen its long-term business model."
        },
        {
            "published_date": "2025-05-18T16:04:16",
            "title": "As Hyperbitcoinization Looms, Which Cryptocurrency Holds the Most Potential?",
            "author": "Brave New Coin",
            "url": "https://article.wn.com/view/2025/05/18/As_Hyperbitcoinization_Looms_Which_Cryptocurrency_Holds_the_",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Hyperbitcoinization refers to a future scenario where Bitcoin overtakes traditional fiat currencies as the dominant medium of exchange and store of value. It was once considered a far-off dream, but recent developments indicate it's not such a far off dream any more. "
        },
        {
            "published_date": "2025-05-18T16:00:21",
            "title": "Analysts Call The Top For Bitcoin Dominance; Solana, Remittix and XRP Set To Skyrocket",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/markets/analysts-call-the-top-for-bitcoin-dominance-solana-remittix-and-xrp-set-to-skyrocket/ar-AA1F0syy",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "A few weeks ago, Bitcoin was commanding nearly 65% of the entire crypto market cap. Now, eyes are turning to key players outside Bitcoin: Solana, the legal survivor with real-world utility, and Remittix, the newcomer shaking up crypto-to-fiat payments."
        },
        {
            "published_date": "2025-05-18T16:00:00",
            "title": "Breaking Down Trump's Entanglements With Crypto",
            "author": "Amrith Ramkumar",
            "url": "https://www.msn.com/en-us/money/markets/breaking-down-trump-s-entanglements-with-crypto/ar-AA1F0hhF",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Trump is hosting a dinner for holders of his memecoin, $TRUMP, on Thursday. He established a national digital-asset stockpile similar to the U.S. gold reserve in March. Trump's team is trying to shepherd two crypto bills through Congress in the coming months."
        },
        {
            "published_date": "2025-05-18T16:00:00",
            "title": "Breaking Down Trump's Entanglements With Crypto",
            "author": "Amrith Ramkumar",
            "url": "https://www.wsj.com/finance/currencies/breaking-down-trumps-entanglements-with-crypto-fe13ec3e",
            "url_media": "https://images.wsj.net/im-25475911/social",
            "country": "US",
            "language": "en",
            "summary": "President Trump and his family are big fans of cryptocurrencies. Critics have raised ethical concerns given Trump's vast business interests in the sector. Here's what you need to know about his crypto moves and how they relate to his business interests and his business.   "
        },
        {
            "published_date": "2025-05-18T15:52:57",
            "title": "Trump hints at China trip after tariff cuts",
            "author": "Mehab Qureshi",
            "url": "https://finance.yahoo.com/news/trump-hints-china-trip-tariff-155257171.html",
            "url_media": "https://media.zenfs.com/en/thestreet_881/37d49c4b54f7c93fde44c9854a4031a8",
            "country": "US",
            "language": "en",
            "summary": "There was a 90-day trade truce between the U.S. and China. The US reduced tariffs on Chinese goods from 145% to 30%, while China slashed its own rates from 125% to 10%. Bitcoin has dipped 0.8% over the last 24 hours, but the broader sentiment remains positive. Bitcoin's path to all-time highs of $109,000 could be closer than it seems."
        },
        {
            "published_date": "2025-05-18T15:40:00",
            "title": "MUTM and DOGE price prediction – Next Cryptocurrencies to hit $1?",
            "author": "",
            "url": "https://cyprus-mail.com/2025/05/18/mutm-and-doge-price-prediction-next-cryptocurrencies-to-hit-1",
            "url_media": "https://cyprus-mail.com/wp-content/uploads/2025/05/feat6-1.png",
            "country": "CY",
            "language": "en",
            "summary": "Dogecoin (DOGE) is surging with a 528% spike in active addresses. Mutuum Finance (MUTM) is drawing crowds in its presale phase 4, raising $8,600,000 and selling over 481 million tokens to 10,000 holders. Both tokens are sparking bold predictions in the crypto market, with analysts forecasting a race to $1 in 2025."
        },
        {
            "published_date": "2025-05-18T15:28:23",
            "title": "International Monetary Fund paper suggests CBDCs could turn society cashless",
            "author": "Tim Hinchliffe",
            "url": "https://www.todayville.com/international-monetary-fund-paper-suggests-cbdcs-could-turn-society-cashless",
            "url_media": "https://i0.wp.com/www.todayville.com/wp-content/uploads/2025/05/tvrd-cbdc-central-bank-digital-currency-image-2025-05-18.jpg?fit=600%2C370&ssl=1",
            "country": "US",
            "language": "en",
            "summary": "IMF working paper suggests that cash may disappear from society entirely once central bank digital currencies become mainstream. Central Bank of Bahrain governor Khalid Humaidan said last year that one of the goals of CBDCs was to replace cash with digital currency. IMF acknowledges the risks to privacy, potential for government surveillance, and how public and private entities could leverage user data for nefarious means."
        },
        {
            "published_date": "2025-05-18T15:22:15",
            "title": "Best Altcoins to Buy Now as Contracting Supply Set to Push Bitcoin past $200K by ...",
            "author": "News BTC",
            "url": "https://article.wn.com/view/2025/05/18/Best_Altcoins_to_Buy_Now_as_Contracting_Supply_Set_to_Push_B",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Matt Hougan, the chief investment officer of Bitwise, said Bitcoin can hit the $200K mark by the end of 2025 due to rapidly contracting supply and increasing demand. Bitcoin is expected to reach the milestone due to rapid growth in demand and supply. "
        },
        {
            "published_date": "2025-05-18T15:21:17",
            "title": "When Will the Altcoin Bull's Forerunner, Bitcoin Dominance Decline, Arrive? Grayscale Responds",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/When_Will_the_Altcoin_Bull_s_Forerunner_Bitcoin_Dominance_De",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin's decline is predicted to trigger a rise in altcoins. Grayscale responded to the predictions about Bitcoin's decline and the rise of altcoins on its decline.      Â   iReport.com: When Will Bitcoin Dominance Decline and the Rise of Altcoins Arrive? "
        },
        {
            "published_date": "2025-05-18T15:16:13",
            "title": "Bitcoin Price Could Reach $159,000 This Cycle — Crypto Analyst Reveals How",
            "author": "Bitcoinist",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Price_Could_Reach_159000_This_Cycle_Crypto_Analyst_R",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "The Bitcoin price struggled to keep up its momentum in the first quarter of 2025. The macroeconomic uncertainty in the United States is the main reason for the decline. However, prices are still rising.   in early April, prices in the crypto market are up."
        },
        {
            "published_date": "2025-05-18T15:10:00",
            "title": "Whales are holding onto MUTM while retail chases hype — What do they know?",
            "author": "",
            "url": "https://cyprus-mail.com/2025/05/18/whales-are-holding-onto-mutm-while-retail-chases-hype-what-do-they-know",
            "url_media": "https://cyprus-mail.com/wp-content/uploads/2025/05/feat5-1.png",
            "country": "CY",
            "language": "en",
            "summary": "Mutuum Finance (MUTM) is a new decentralized, non-custodial protocol where users can lend and borrow crypto assets without giving up ownership. Its Phase 4 presale is now over 87% complete with more than $8.6 million raised and nearly 10,000 holders involved. Whale wallets are staking out early positions in a project built around real mechanics."
        },
        {
            "published_date": "2025-05-18T15:00:08",
            "title": "Chinese firm launches ‘unhackable' quantum cryptography system",
            "author": "Zhang Tong",
            "url": "https://www.scmp.com/news/china/science/article/3310817/chinese-firm-launches-unhackable-quantum-cryptography-system",
            "url_media": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2025/05/18/b9f868aa-3d57-4bea-9e8a-761801e2ee4e_5140c1d9.jpg?itok=WPgmwEKq&v=1747563106",
            "country": "HK",
            "language": "en",
            "summary": "China Telecom Quantum Group announced the launch of the world's first distributed cryptography system that integrates two key technologies last week. The company completed the first cross-regional quantum-encrypted phone call over a distance of more than 1,000 km between Beijing and the city of Hefei using this integrated system."
        },
        {
            "published_date": "2025-05-18T14:57:37",
            "title": "Trump meme coin dinner likely to include mostly non-Americans based on top $TRUMP holders",
            "author": "MacKenzie Sigalos",
            "url": "https://news.knowledia.com/all/all/articles/trump-meme-coin-dinner-likely-to-include-mostly-non-americans-based-on-a1fbc1890a6df052248e96f6ff83f54250529dc4",
            "url_media": "https://image.cnbcfm.com/api/v1/image/108140918-1746451285527-gettyimages-2198663023-raa-donaldtr250213_npNrt.jpeg?v=1747459262",
            "country": "FR",
            "language": "en",
            "summary": "The top 220 meme coin holders are invited to a dinner with the president at his Virginia golf club on May 22. The event was announced last month and the tally closed on Monday night. The leaderboard is awash with pseudonymous wallets that are effectively anonymous."
        },
        {
            "published_date": "2025-05-18T14:47:23",
            "title": "POPEcoin Raises $1.5 Million in Ten Days with No VCs, No Taxes, and No Apologies",
            "author": "",
            "url": "https://apnews.com/press-release/globenewswire-mobile/telegram-1b48ed286eb124f6f2ed184d83698525",
            "url_media": "https://dims.apnews.com/dims4/default/39220f1/2147483647/strip/true/crop/597x336+1+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2Fb5%2F5b7c1faa549578f3dffdf321cc5e%2Ff2bbbb2ad7fa305cff823b630ea477a2",
            "country": "US",
            "language": "en",
            "summary": "POPEcoin raised $1.5 million in 10 days. The project has already drawn over 25,000 organic followers across Twitter and Telegram. POPEcoin has announced plans for POPEchain, a Bitcoin Layer 2 infrastructure dedicated to supporting on-chain storytelling, decentralized culture, and community-driven engagement."
        },
        {
            "published_date": "2025-05-18T14:37:18",
            "title": "Nimanode: Powering the First No-Code AI Agent Platform Built on XRP Ledger",
            "author": "",
            "url": "https://apnews.com/press-release/globenewswire-mobile/artificial-intelligence-218e71594395300c93dd3626e10472ad",
            "url_media": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png",
            "country": "US",
            "language": "en",
            "summary": "Nimanode is a first-of-its-kind AI automation platform built on the XRP Ledger. It's a platform that empowers users from non-coders to skilled developers to launch autonomous AI agents that execute smart contracts, access risk, automate on-chain operations, ensure compliance with global regulatory standards and interact intelligently across decentralized platforms. Nimanode uses the $NMA token to fuel the development of the platform."
        },
        {
            "published_date": "2025-05-18T14:15:11",
            "title": "Arthur Breitman is betting on tokenized uranium, and it could be Tezos' big comeback",
            "author": "Cryptoslate",
            "url": "https://article.wn.com/view/2025/05/18/Arthur_Breitman_is_betting_on_tokenized_uranium_and_it_could",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "CryptoSlate is Slate's new weekly feature showcasing in-depth interviews, expert analysis, and thought-provoking op-eds that go beyond the headlines to explore the ideas and voices shaping the future of crypto. The last time Slate featured a crypto topic was \"Our Lady of Paris\"."
        },
        {
            "published_date": "2025-05-18T14:15:03",
            "title": "Ethereum, XRP, and DOGE Are Hitting Key Technical Levels — Will a Major Breakout Follow in June?",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/markets/ethereum-xrp-and-doge-are-hitting-key-technical-levels-will-a-major-breakout-follow-in-june/ar-AA1F0flb",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Ether, XRP and Dogecoin are showing some coiling price action just below key resistance levels. Up-and-coming projects like MAGACOIN FINANCE are gaining some interest in the market. They focus on early-stage positioning, risk-reward asymmetry and community-led discovery."
        },
        {
            "published_date": "2025-05-18T14:09:10",
            "title": "Crypto VC funding: Gnosis, HQ lead with $14.95m acquisition; Perpl raises $9.25m",
            "author": "BTC Manager",
            "url": "https://article.wn.com/view/2025/05/18/Crypto_VC_funding_Gnosis_HQ_lead_with_1495m_acquisition_Perp",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "The crypto funding market saw $73.2 million in total investments during the week of May 11-17, according to CoinMarketCap.com.       .   in total investment during that week.  $73 million was invested in the crypto-funding market. "
        },
        {
            "published_date": "2025-05-18T13:37:41",
            "title": "What is crypto staking?",
            "author": "Ashley N. Soriano",
            "url": "https://www.yahoo.com/news/crypto-staking-133741472.html",
            "url_media": "https://media.zenfs.com/en/newsnation_articles_600/4272213cea67d41ec373144337e12184",
            "country": "US",
            "language": "en",
            "summary": "Crypto staking is the process of locking digital tokens to a blockchain network to earn rewards. The rewards are usually a percentage of the number of tokens staked. Fidelity Investments says it's crucial for the security and efficiency of some blockchains. Another way to validate transactions is crypto mining."
        },
        {
            "published_date": "2025-05-18T13:30:00",
            "title": "ADA and XRP holders are watching MUTM closely — And it's still trading under $0.03",
            "author": "",
            "url": "https://cyprus-mail.com/2025/05/18/ada-and-xrp-holders-are-watching-mutm-closely-and-its-still-trading-under-0-03",
            "url_media": "https://cyprus-mail.com/wp-content/uploads/2025/05/feat4-3.png",
            "country": "CY",
            "language": "en",
            "summary": "Mutuum Finance (MUTM) is a pre-sale-stage project with a token price of $0.03. It allows users to lend and borrow digital assets through a flexible dual-model structure that includes Peer-to-Contract (P2C) and P2P lending options. MUTM has raised more than $8.6 million to date. The team has confirmed that a beta version of the platform will go live in parallel with the token's listing."
        },
        {
            "published_date": "2025-05-18T13:20:00",
            "title": "From Debanking To Banking Arms-Race - The Rise Of Stablecoins",
            "author": "Tyler Durden",
            "url": "https://www.zerohedge.com/crypto/debanking-banking-arms-race-rise-stablecoins",
            "url_media": "https://cms.zerohedge.com/s3/files/styles/16_9_max_700/public/2025-05/01944f60-e8cc-731c-a8d6-807013ae.jpg?itok=WSMriORv",
            "country": "BG",
            "language": "en",
            "summary": "Stablecoin adoption is increasing. US President Donald Trump hopes to have stablecoin legislation on his desk by August 2025. BlackRock CEO Larry Fink wants the SEC to approve the tokenization of bonds and stocks. Custodia Bank issued its own stablecoin, Avit, on Ethereum."
        },
        {
            "published_date": "2025-05-18T13:16:08",
            "title": "Bitcoin (BTC) Price Prediction for May 19: Bulls Eye $104K but Momentum Still Mixed",
            "author": "Coin Edition",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_BTC_Price_Prediction_for_May_19_Bulls_Eye_104K_but_M",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "The Bitcoin price today is trading around $103,650. It is trying to stabilize just below the key $104,000 resistance zone. The macro trend remains bullish, but the recent Bitcoin price action shows that the recent price action is not as it seems."
        },
        {
            "published_date": "2025-05-18T13:11:00",
            "title": "‘This is the mafia' — How North Korea structures its IT workers like an organized crime syndicate",
            "author": "Amanda Gerut",
            "url": "https://www.yahoo.com/news/mafia-north-korea-structures-workers-131100756.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/nad8kUFZiR0PoUshwLiNIQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04NDU-/https://media.zenfs.com/en/fortune_175/e8ac697682226bc720bb159372ab6abb",
            "country": "US",
            "language": "en",
            "summary": "A report on North Korea's cyber-crime operations has revealed the inner workings and structure behind Kim Jong Un's plan to evolve a lucrative scheme in which trained tech workers infiltrate American and European businesses. The IT workers send nearly their entire salaries home to fund the regime's nuclear weapons program and AI research center. North Korea has pitted its IT workers against each other to spur competition and rake in more money. "
        },
        {
            "published_date": "2025-05-18T13:00:19",
            "title": "Could Ruvi AI (RUVI) Be the Next Dogecoin (DOGE)? Analysts Suggest it Will Skyrocket by 20,000% During Altcoin Season",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/other/could-ruvi-ai-ruvi-be-the-next-dogecoin-doge-analysts-suggest-it-will-skyrocket-by-20-000-during-altcoin-season/ar-AA1F05cI",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Dogecoin is trading at $0.2164, while Ruvi is making waves as a disruptive force in the blockchain landscape with its implementation of AI-powered solutions. Ruvi's presale sold out in just over two weeks, offering early adopters a 50% ROI. Analysts forecast a $1 future price for Ruvi."
        },
        {
            "published_date": "2025-05-18T12:58:02",
            "title": "Hiltzik: Crypto was already in bad odor before jumping into bed with Trump. Now it smells worse",
            "author": "Class",
            "url": "https://www.columbian.com/news/2025/may/18/hiltzik-crypto-was-already-in-bad-odor-before-jumping-into-bed-with-trump-now-it-smells-worse",
            "url_media": "https://www.columbian.com/wp-content/themes/columbian2/static/img/og/default-2022.jpg",
            "country": "US",
            "language": "en",
            "summary": "Crypto trading has become identified by regulators and in the public mind as a haven for scams, theft and other forms of sharp practice. The FBI found that crypto-related fraud has exploded and criminality is 'pervasive' in the field. The elusive use case for crypto assets seemed to have been narrowed down to facilitating criminal fraud, ransomware attacks, drug and human trafficking before Donald Trump's election."
        },
        {
            "published_date": "2025-05-18T12:56:02",
            "title": "Bitcoin's Anticipated Price Surge Amidst Market Dynamics",
            "author": "",
            "url": "https://www.newsbreak.com/trending-story/bitcoin's-anticipated-price-surge-amidst-market-dynamics-6829d8e2d36e2877ec403179",
            "url_media": "https://static.newsbreak.com/static/share-logo.png",
            "country": "PH",
            "language": "en",
            "summary": "Trader Tardigrade, a prominent crypto analyst, has set an ambitious early-week target of $116,000 for Bitcoin. Bitcoin is currently trading at approximately $94,500 on major exchanges like Binance and Coinbase. The analyst's prediction suggests a potential 22.7% rally in the coming days."
        },
        {
            "published_date": "2025-05-18T12:24:17",
            "title": "Ex-Binance exec Vladimir Smerkis arrested in Moscow on fraud charges",
            "author": "Nellius Irene",
            "url": "https://www.msn.com/en-us/news/crime/ex-binance-exec-vladimir-smerkis-arrested-in-moscow-on-fraud-charges/ar-AA1F02tv",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Vladimir Smerkis has been arrested in Moscow for fraud. He is the former head of Binance's CIS division and co-founder of the crypto game Blum. He has resigned from his position as Chief Marketing Officer and is no longer working on the project or serving on its team."
        },
        {
            "published_date": "2025-05-18T12:19:39",
            "title": "Is MAGACOIN FINANCE Gaining Attention as Solana and XRP Traders Rotate Into New High-Upside Positions?",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/markets/is-magacoin-finance-gaining-attention-as-solana-and-xrp-traders-rotate-into-new-high-upside-positions/ar-AA1F04zN",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The altcoin rotation dynamic is evolving in this final phase of May 2025. Traders are transferring capital in order to capitalize on the volatility and upside potential to generate fresh momentum. One of the standout projects so far in May is Solana (SOL). XRP has found itself in the narrative spotlight again with recent ETF speculation and adoption headlines. MAGACOIN FINANCE has had steady daily participants increase in presale."
        },
        {
            "published_date": "2025-05-18T12:18:00",
            "title": "BlockDAG Joins ADA, XRP &amp; SOL in the Best Cryptos of 2025, But It's Just $0.0020!",
            "author": "",
            "url": "https://www.theportugalnews.com/news/2025-05-18/blockdag-joins-ada-xrp-amp-sol-in-the-best-cryptos-of-2025-but-its-just-00020/97751",
            "url_media": "https://d1mnxluw9mpf9w.cloudfront.net/media/1747571451/crypto.png",
            "country": "PT",
            "language": "en",
            "summary": "BlockDAG (BDAG) is a new contender in the crypto market. It has raised nearly $255 million and sold over 20.5 billion coins. Its X1 Miner App recently crossed 1 million downloads. Cardano (ADA), Ripple (XRP), and Solana (SOL) are showing fresh signs of life."
        },
        {
            "published_date": "2025-05-18T12:18:00",
            "title": "Solana Selling Prevents $180 Breakout But Unilabs Shocks With $200,000 Raised in 24 Hours",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/savingandinvesting/solana-selling-prevents-180-breakout-but-unilabs-shocks-with-200-000-raised-in-24-hours/ar-AA1EZZRQ",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "As the market cools on Layer-1s like Solana, smart money seems to be flowing into Unilabs. It is a cutting-edge AI-backed asset manager that has raised over $200,000 in 24 hours and has $30 million AUM. It offers transparency, automated portfolio optimization, and AI-managed funds. It also offers a comprehensive launchpad that offers detailed insights on different assets."
        },
        {
            "published_date": "2025-05-18T12:15:56",
            "title": "Sharp Cedi gains may trigger volatility",
            "author": "Class",
            "url": "https://citinewsroom.com/2025/05/sharp-cedi-gains-may-trigger-volatility-prof-asuming-warns",
            "url_media": "https://citinewsroom.com/wp-content/uploads/2025/05/Screenshot-2025-05-17-095121-1.png",
            "country": "GH",
            "language": "en",
            "summary": "The recent appreciation of the Ghanaian cedi could introduce market volatility, according to Prof. Patrick Asuming. He would have preferred a more measured and steady rise in the currency's value. He also questioned the rationale behind the apparent government intervention that may have triggered the appreciation."
        },
        {
            "published_date": "2025-05-18T12:11:27",
            "title": "WATCH: Scott Bessent, Waters Clash Over DOGE Access To Treasury Dept. Info",
            "author": "Jon Dougherty",
            "url": "https://conservativebrief.com/waters-clash-91647",
            "url_media": "https://conservativebrief.com/wp-content/uploads/2025/05/GettyImages-2213264462-1.jpg",
            "country": "US",
            "language": "en",
            "summary": "Treasury Secretary Scott Bessent and Rep. Maxine Waters clashed during a hearing regarding Department of Government Efficiency's access to Treasury's information. Waters is upset that DOGE chief Elon Musk and those working under him have been granted 'unfettered' access to the country's financial systems. Bessen is the most popular Cabinet member with a +14 net approval rating."
        },
        {
            "published_date": "2025-05-18T12:05:41",
            "title": "Analysts Say Ethereum, Dogecoin, and Litecoin Could Post Double-Digit ROI Gains by Mid-2025",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/savingandinvesting/analysts-say-ethereum-dogecoin-and-litecoin-could-post-double-digit-roi-gains-by-mid-2025/ar-AA1F01VX",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "As mid-2025 approaches, major altcoins are flashing mixed signals amid shifting investor appetite and macroeconomic recalibrations. The broader crypto market is leaning toward recovery, with some mid-tier assets outperforming in recent weeks. Dogecoin (DOGE) is currently priced at approximately $0.2226, marking an increase of 1.72% in price over the last 24 hours and 48.68% year-over-year. Litecoin (LTC) has begun to give ground retracing back to value of $97.32, after trading a high of $101.76 earlier on May 17. MAGACOIN FINANCE is moving through"
        },
        {
            "published_date": "2025-05-18T12:01:41",
            "title": "Crypto Price Predictions: Solana (SOL), Mutuum Finance (MUTM), and Ethereum (ETH)",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/markets/crypto-price-predictions-solana-sol-mutuum-finance-mutm-and-ethereum-eth/ar-AA1EZPSL",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Crypto price predictions are igniting fervor in the market as investors hunt for the best crypto to buy now. Mutuum Finance (MUTM) is soaring past phase 4 of its presale, generating $8,500,000. Solana (SOL) is down 42% from its high of $294.33 to $173.28. Due to network enhancements, Ethereum (ETH) is now trading at $2,509."
        },
        {
            "published_date": "2025-05-18T11:20:02",
            "title": "Paris kidnap attempt highlights need for crypto data security",
            "author": "Owotunse Adebayo",
            "url": "https://www.msn.com/en-us/news/world/paris-kidnap-attempt-highlights-need-for-crypto-data-security/ar-AA1EZUcX",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "There has been an increase in the number of kidnappings linked to the crypto community in the French capital, Paris. The latest one was the attempted kidnapping of Pierre Noizat's relatives on Tuesday. French interior minister Bruno Rataileau announced a meeting with crypto professionals to discuss a way forward. The Director of Strategy at French crypto exchange Paymium has taken a dig at how information related to crypto transfers under EU rules must be collected."
        },
        {
            "published_date": "2025-05-18T11:17:03",
            "title": "Mark Your Calendars – Donald Trump to Host Major Cryptocurrency Event, Details Begin to Emerge",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Mark_Your_Calendars_Donald_Trump_to_Host_Major_Cryptocurrenc",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Donald Trump is preparing to meet with major holders of his cryptocurrency, Trump's own, to discuss the future of the Donald Trump's company, Trump’s Precious Meteocoin. Trump is also planning to host a major cryptocurrency event, as reported earlier."
        },
        {
            "published_date": "2025-05-18T11:00:01",
            "title": "Trump meme coin dinner likely to include mostly non-Americans based on top $TRUMP holders",
            "author": "MacKenzie Sigalos",
            "url": "https://www.cnbc.com/2025/05/18/trump-coin-dinner-to-include-mostly-non-americans-based-on-top-holders.html",
            "url_media": "https://image.cnbcfm.com/api/v1/image/108140918-1746451285527-gettyimages-2198663023-raa-donaldtr250213_npNrt.jpeg?v=1747459262&w=1920&h=1080",
            "country": "US",
            "language": "en",
            "summary": "The leaderboard for the $TRUMP meme coin leaderboard is awash with anonymous wallets. The top 220 $TRUMP holders are invited to a dinner with the president at his Virginia golf club on May 22. Justin Sun is at the top of the leaderboard with $75 million worth of the Trump family's World Liberty Financial token. MemeCore, a Singapore-based crypto network, landed in second place with an investment of $18 million. Freight Technologies, a Houston-based logistics firm with a market cap of $2.3 million, bought $2 million of $TRUMP tokens to influence U.S.-Mexico trade policy."
        },
        {
            "published_date": "2025-05-18T11:00:00",
            "title": "What Is A Cryptocurrency ETF? A Guide For Crypto Investors Looking To Diversify",
            "author": "Becca Bratcher",
            "url": "https://www.forbes.com/sites/digital-assets/article/what-is-cryptocurrency-etf",
            "url_media": "https://imageio.forbes.com/specials-images/imageserve/678a9182522569078a65038b/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
            "country": "US",
            "language": "en",
            "summary": "A cryptocurrency exchange-traded fund (ETF) is an investment vehicle that allows investors to gain exposure to digital assets without directly holding them. Spot and futures-based crypto ETFs are available in two main forms: spot and futures. Spot ETFs hold the actual crypto in the case of spot ETFs and derivative contracts that reflect crypto prices. Futures-based ether ETFs do not hold ETH directly. Multi-Crypto ETFs provide access to a mix of several cryptos within a single fund."
        },
        {
            "published_date": "2025-05-18T11:00:00",
            "title": "Premier touts digital finance momentum",
            "author": "Claire Shefchik",
            "url": "https://www.royalgazette.com/local-business/business/article/20250518/premier-touts-digital-finance-momentum",
            "url_media": "https://imengine.public.prod.rgb.navigacloud.com/?uuid=c4d2dfda-5d75-5909-97e7-65de41948154&function=fit&type=preview",
            "country": "BM",
            "language": "en",
            "summary": "David Burt, the Premier, highlighted Bermuda's growing influence in the digital finance world during a featured fireside chat at Consensus 2025 in Toronto. He appeared with SkyBridge's John Darsie for a wide-ranging conversation about the island's evolving digital asset strategy. Mr Burt and Jason Hayward met with companies including Excellar, Coinbase and Franklin Templeton."
        },
        {
            "published_date": "2025-05-18T10:58:03",
            "title": "D-Wave Quantum (QBTS) Stock Jumps after Quantum Breakthrough and 507% Revenue Jump",
            "author": "Tip Ranks",
            "url": "https://markets.businessinsider.com/news/stocks/d-wave-quantum-qbts-stock-jumps-after-quantum-breakthrough-and-507-revenue-jump-1034740342",
            "url_media": "https://blog.tipranks.com/wp-content/uploads/2025/05/image-1143.png?utm_source=markets.businessinsider.com&amp;utm_medium=referral",
            "country": "US",
            "language": "en",
            "summary": "D-Wave Quantum (QBTS) just delivered what CEO Alan Baratz called the most significant quarter in the company's history. Following strong financial results and a groundbreaking quantum computing milestone, the stock jumped more than 14% this week. QBTS has a record cash position of over $300 million, a proven commercial product, and a headline-making scientific breakthrough."
        },
        {
            "published_date": "2025-05-18T10:40:48",
            "title": "Bangladesh's go-to app: Why millions rely on bKash",
            "author": "Samia Huda",
            "url": "https://www.thedailystar.net/business/organisation-news/press-releases/news/bangladeshs-go-app-why-millions-rely-bkash-3897561",
            "url_media": "https://tds-images.thedailystar.net/sites/default/files/styles/social_share/public/images/2025/05/18/bkash_pr.png",
            "country": "BD",
            "language": "en",
            "summary": "bKash app is an essential tool in daily life for millions of Bangladeshis. With 80 million verified users, bKash serves roughly 1 percent of the global population. The success of the app lies in how well-thoughtfully every feature is built and how easily anyone can use it."
        },
        {
            "published_date": "2025-05-18T10:06:01",
            "title": "AFP seizes Bitcoin, luxury car, and mansion in connection with cybercrime probe",
            "author": "Owotunse Adebayo",
            "url": "https://www.msn.com/en-us/money/companies/afp-seizes-bitcoin-luxury-car-and-mansion-in-connection-with-cybercrime-probe/ar-AA1EZHL2",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "The Australian Federal Police (AFP) have seized luxury assets linked to a hacker who was convicted of cybercrime offenses. According to reports, authorities seized assets worth $4.5 million, including a beachfront mansion, luxury cars, and Bitcoin. Shane Duffy, 32, from Queensland, saw millions worth of those assets seized after a lengthy investigation into his illegal activities. He was apprehended on charges of stealing digital assets and cyber hacking. The authorities seized Duffy's beachfront home back in April. They also seized a 2019 black Mercedes-Benz sedan and about 25 Bitcoins."
        },
        {
            "published_date": "2025-05-18T10:00:00",
            "title": "This 1 Catalyst Could Send Bitcoin Skyrocketing Higher, According to Silicon Valley Billionaire Tim Draper",
            "author": "Dominic Basulto",
            "url": "https://finance.yahoo.com/news/1-catalyst-could-send-bitcoin-100000640.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/bSYQtrj_69e0d9BRKgd9eA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/motleyfool.com/95de62791b0cc0bee24e5cfcaf304170",
            "country": "US",
            "language": "en",
            "summary": "MicroStrategy pioneered the idea of buying Bitcoin. Now other companies are starting to follow its example. According to Silicon Valley venture capitalist Tim Draper, corporations have a responsibility to buy Bitcoin to maximize shareholder value. If America's publicly traded corporations decide to go on a Bitcoin buying spree, it could send the price of Bitcoin soaring to new all-time highs."
        },
        {
            "published_date": "2025-05-18T09:45:43",
            "title": "Bitcoin vs USD: Global Dominance Race – Archyde: Latest World News, Economy, Entertainment, Health, Technology & Sports Updates",
            "author": "archyde",
            "url": "https://www.archyde.com/bitcoin-vs-usd-global-dominance-race",
            "url_media": "https://img.etimg.com/photo/118783427.cms",
            "country": "US",
            "language": "en",
            "summary": "The U.S. dollar is the world's most widely accepted currency. Bitcoin is the first decentralized currency. Central bank digital currencies (CBDCs) are emerging as a potential middle ground between traditional fiat currencies and cryptocurrencies like Bitcoin. CBDCs offer the benefits of digital transactions while maintaining the stability and regulatory oversight of central banks."
        },
        {
            "published_date": "2025-05-18T09:26:00",
            "title": "Bitcoin Eyeing ATH? Next Stop $120k",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Eyeing_ATH_Next_Stop_120k",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin (BTC) is trading at approximately $103,318, reflecting a slight decline of 0.19% over the last 24 hours.    - Bitcoin is worth about $100,000 now. - Bitcoin's value has declined by 0.2% since last Friday. "
        },
        {
            "published_date": "2025-05-18T09:11:58",
            "title": "Bitcoin Price Flat But This ICO Crypto Gifting BTC Goes Parabolic",
            "author": "Inside Bitcoins",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Price_Flat_But_This_ICO_Crypto_Gifting_BTC_Goes_Para",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "The Bitcoin price has climbed 0.26% after the announcement of the increase in Bitcoin supply.   Â      i.e. the supply has increased by 1.26%. The increase is due to the increase of the supply of Bitcoin. "
        },
        {
            "published_date": "2025-05-18T09:00:00",
            "title": "Prediction: Bitcoin Could Be Worth $20 Trillion in 5 Years",
            "author": "Dominic Basulto",
            "url": "https://finance.yahoo.com/news/prediction-bitcoin-could-worth-20-090000591.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/Hlc_khod0jk.VrtlAxAPyg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/motleyfool.com/9037b62e2cbffa6a84ac70363cdd24dd",
            "country": "US",
            "language": "en",
            "summary": "In the past decade, Bitcoin has transformed from a digital currency into a unique, standalone asset. If Bitcoin is truly digital gold, it could skyrocket in value to $20 trillion from its current $2 trillion market cap. Anthony Scaramucci, founder of SkyBridge Capital, is looking for 1 billion active Bitcoin users worldwide."
        },
        {
            "published_date": "2025-05-18T08:46:32",
            "title": "Not many people remember that NH Nonghyup Bank was once the dominant digital banking owner in Korea...",
            "author": "Kim Jung-Hwan Han Sang-Heon",
            "url": "https://www.mk.co.kr/en/economy/11320033",
            "url_media": "https://wimg.mk.co.kr/news/cms/202505/19/20250519_01110114000003_L00.jpg",
            "country": "KR",
            "language": "en",
            "summary": "Kang Tae-young is the president of NH Nonghyup Bank. He wants to revive the bank's digital strategy and rise back to the top of the industry. He plans to develop a roadmap for virtual asset-related businesses and partnerships with IT companies such as Naver. "
        },
        {
            "published_date": "2025-05-18T08:42:38",
            "title": "Bitcoin Solaris Unveils Hybrid Consensus Architecture Ahead of Nova App Mining Launch",
            "author": "Bitcoin Solaris",
            "url": "https://apnews.com/press-release/globenewswire-mobile/nova-app-metals-and-mining-5942e98dc64cc0dd5fb5a3844b3d3b22",
            "url_media": "https://dims.apnews.com/dims4/default/8f176df/2147483647/strip/true/crop/133x75+233+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2F84%2Fc9145d0214ecc9c2e11d78916a8a%2F653d1029eabb5ad64a6281c6f30467f6",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin Solaris is unveiling its advanced hybrid consensus architecture, purpose-built to support fast, decentralized applications with user-integrated mining and sub-2-second finality. The Nova App will soon activate mobile-native mining via the Nova App. Presale Phase 3 is currently live, offering BTC-S tokens at 3 USDT each."
        },
        {
            "published_date": "2025-05-18T08:41:20",
            "title": "Gaming hacker's waterfront mansion and Mercedes Benz seized in major cybercrime probe",
            "author": "CHARLOTTE MCINTYRE",
            "url": "https://www.dailymail.co.uk/news/article-14723937/shane-duffy-hacker-assets-seized.html",
            "url_media": "https://i.dailymail.co.uk/1s/2025/05/18/08/98496079-0-image-a-7_1747554757522.jpg",
            "country": "GB",
            "language": "en",
            "summary": "Shane Stephen Duffy, 32, from Queensland had millions of dollars worth of assets seized following a lengthy investigation into stolen cryptocurrency and cyber hacking. In April, a beachfront home, a 2019 black Mercedes-Benz sedan and nearly 25 Bitcoin were seized by the AFP-led Criminal Assets Confiscation Taskforce. Duffy is suspected of stealing 950 Bitcoin from a French cryptocurrency exchange in 2013, now worth about $150million. He had previously been convicted of hacking US-based gaming company Riot Games, the company behind the popular video game League of Legends."
        },
        {
            "published_date": "2025-05-18T08:23:52",
            "title": "XRP Price Surges After V-Shaped Recovery, Targets $3.40",
            "author": "AI Boost",
            "url": "https://au.finance.yahoo.com/news/xrp-price-surges-v-shaped-082352403.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/KUDvs1O31VZKMImIKgo_kw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03MzQ-/https://media.zenfs.com/en/coindesk_75/09d21148bfa26c36aa71979c01d40736",
            "country": "US",
            "language": "en",
            "summary": "XRP experienced a 3.76% range ($2.307-$2.396) over 24 hours with a sharp sell-off at 16:00. Price surged past resistance at $2.36 to reach $.366 and established new local highs at $.369 during 02:03 session on substantial volume (539,987)."
        },
        {
            "published_date": "2025-05-18T08:20:57",
            "title": "Bitcoin Price Currently At A Crossroads — Sub-$100K Or New Cycle High Next?",
            "author": "Bitcoinist",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Price_Currently_At_A_Crossroads_Sub100K_Or_New_Cycle",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin's value has risen by nearly 25% in the past month. Bitcoin price has managed to stay above the six-figure valuation. Bitcoin is one of the best performers among the large-cap assets in the recent months.   Â   "
        },
        {
            "published_date": "2025-05-18T08:17:46",
            "title": "Thread by @mitev_andon on Thread Reader App",
            "author": "",
            "url": "https://threadreaderapp.com/thread/1924016549284774012.html",
            "url_media": "https://threadreaderapp.com/images/screenshots/thread/1924016549284774012.jpg",
            "country": "US",
            "language": "en",
            "summary": "ZBOT is a Gen Z-native AI trading agent built to dominate onchain markets. It's a self-operating crypto-native trader. The Launchpad lets you to build your own AI agent and create it into an open AI economy earning $VIRTUAL and Yapp Points."
        },
        {
            "published_date": "2025-05-18T08:11:45",
            "title": "Bitcoin vs USD: Why BTC is yet to catch up to the dollar for global dominance",
            "author": "",
            "url": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-news/bitcoin-vs-usd-why-btc-is-yet-to-catch-up-to-the-dollar-for-global-dominance/articleshow/121247041.cms",
            "url_media": "https://img.etimg.com/thumb/width-1200,height-900,imgsize-89910,resizemode-75,msid-121247041/markets/cryptocurrency/crypto-news/bitcoin-vs-usd-why-btc-is-yet-to-catch-up-to-the-dollar-for-global-dominance.jpg",
            "country": "IN",
            "language": "en",
            "summary": "In 2009, Satoshi Nakamoto launched Bitcoin, the world's first decentralised currency. The US has created a Strategic Bitcoin Reserve, countries have used it to complete trade, and in El Salvador, it has garnered legal tender status. The current world order that is headed by the USA provides the US Dollar with extensive stability, something that cannot be said about any other currency. Bitcoin is widely known for its volatility and its high transaction costs."
        },
        {
            "published_date": "2025-05-18T08:00:00",
            "title": "COMMENTARY: States should follow New Hampshire in establishing Bitcoin reserves",
            "author": "",
            "url": "https://www.newstribune.com/news/2025/may/18/commentary-states-should-follow-new-hampshire-in",
            "url_media": "https://wehco.media.clients.ellingtoncms.com/imports/adg/img/2025/05/18/210122878_Keith-Ammon_t1200.jpg?57a0c2296240c280e9492005c3cad63e7cbe80f4",
            "country": "US",
            "language": "en",
            "summary": "New Hampshire became the first state to authorize a strategic Bitcoin reserve. The state treasurer can invest up to 5 percent of certain state-held funds in Bitcoin or precious metals. The national debt has surpassed $36.2 trillion and interest payments will reach $952 billion in 2025. 16 states have introduced similar legislation."
        },
        {
            "published_date": "2025-05-18T08:00:00",
            "title": "COMMENTARY: States should refuse to make risky bets on crypto",
            "author": "",
            "url": "https://www.newstribune.com/news/2025/may/18/commentary-states-should-refuse-to-make-risky",
            "url_media": "https://wehco.media.clients.ellingtoncms.com/imports/adg/img/2025/05/18/210122930_Mark-Hays_t1200.jpg?57a0c2296240c280e9492005c3cad63e7cbe80f4",
            "country": "US",
            "language": "en",
            "summary": "States should think twice before creating state strategic crypto reserves. New Hampshire's lawmakers have placed a dubious bet using public funds on a shady and risky product. The main argument for a crypto reserve is that the numbers will go up. Big crypto assets like Bitcoin are said to appreciate over time."
        },
        {
            "published_date": "2025-05-18T07:55:00",
            "title": "3 Financial Stocks to Buy With $3,000 and Hold Forever",
            "author": "Leo Sun",
            "url": "https://finance.yahoo.com/news/3-financial-stocks-buy-3-075500684.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/W1ylnoMqAG8lIpLUuRXUqg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/motleyfool.com/17805d6e706b761a17a5b59a4a87a028",
            "country": "US",
            "language": "en",
            "summary": "Robinhood Markets, Nu Holdings and Coinbase Global are good investments for $3,000. Robinhood attracted a lot of younger investors with its commission-free trades, streamlined mobile app, and gamified approach to investing. Nu has a first mover's advantage in Latin America's fertile digital banking market. Coinbase is one of the world's largest cryptocurrency exchanges."
        },
        {
            "published_date": "2025-05-18T07:50:00",
            "title": "QLD Man Forfeits $4.5M Assets in Crime Probe",
            "author": "Mirage News",
            "url": "https://www.miragenews.com/qld-man-forfeits-4-5m-assets-in-crime-probe-1462039",
            "url_media": "https://www.afp.gov.au/sites/default/files/styles/og/public/2025-05/Actual%20image%20of%20the%20home%20seized.png?itok=usIwphnS",
            "country": "US",
            "language": "en",
            "summary": "The AFP-led Criminal Assets Confiscation Taskforce (CACT) has secured the forfeiture of more than $4.5 million worth of assets, including a Queensland waterfront mansion, luxury car and Bitcoin. The District Court of Queensland ordered the assets be forfeited to the Commonwealth under the Proceeds of Crime Act (Cth). The CACT was established in 2012 as a proactive and innovative approach to trace, restrain and confiscate criminal assets."
        },
        {
            "published_date": "2025-05-18T07:26:53",
            "title": "Bitcoin's Setup Deepens — This Formation Could Shake Out The Crowd",
            "author": "Bitcoinist",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_s_Setup_Deepens_This_Formation_Could_Shake_Out_The_C",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": ". Bitcoin's recent price action may be more strategic than it appears. A classic inverse head and shoulders pattern seems to be forming, with BTC potentially building out the right shoulder, as it appears to be building the left shoulder, which is forming the right arm. "
        },
        {
            "published_date": "2025-05-18T07:09:00",
            "title": "Moratorium resolution appears likely after Bitcoin debate",
            "author": "Brandon Smith",
            "url": "https://www.timesnews.net/news/appalachian-highlands/moratorium-resolution-appears-likely-after-bitcoin-debate/article_fd73918b-8edc-53fc-84ca-0ca66e5e06a4.html",
            "url_media": "https://bloximages.newyork1.vip.townnews.com/timesnews.net/content/tncms/assets/v3/editorial/1/67/16727621-d0e2-5ed2-8487-f993d52e884f/68298c7ad5a19.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "A packed house voiced concerns to the Johnson City Commission late last week regarding the potential for data centers and Bitcoin mining operations in the city limits. The commission is concerned about the presence of data centers in city limits, specifically Bitcoin mines.    .  "
        },
        {
            "published_date": "2025-05-18T07:06:44",
            "title": "Cycle Top Crypto Price Predictions for Ethereum and Mutuum Finance: How Much Higher Will They Rise?",
            "author": "Cryptopolitan Media",
            "url": "https://www.msn.com/en-us/money/other/cycle-top-crypto-price-predictions-for-ethereum-and-mutuum-finance-how-much-higher-will-they-rise/ar-AA1EZmJl",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Mutuum Finance has raised over $8.6 million from more than 10,000 investors. Phase 4 of the presale is 85% sold out and the price will go up by 20% to $0.03 in Phase 5. Mutuum Finance provides a hybrid lending mechanism incorporating P2C and P2P capabilities. The hybrid system offers stability and control to users."
        },
        {
            "published_date": "2025-05-18T07:00:51",
            "title": "ISIS supporter convicted in Canada's largest terror financing bust",
            "author": "Lauren Marcus",
            "url": "https://worldisraelnews.com/isis-supporter-convicted-in-canadas-largest-terror-financing-bust",
            "url_media": "https://worldisraelnews.com/wp-content/uploads/2018/01/isis.png",
            "country": "IL",
            "language": "en",
            "summary": "Khalilullah Yousuf, 36, was convicted of raising $50,000 for ISIS via crowdfunding and cryptocurrency. He was sentenced to 12 years in prison, half of which he must serve before qualifying for parole. He will receive credit for time spent in pre-trial detention."
        },
        {
            "published_date": "2025-05-18T07:00:00",
            "title": "Bitcoin is too risky for public fundsCOUNTERPOINT",
            "author": "news@pressenterprise.net",
            "url": "https://www.pressenterpriseonline.com/daily/051825/page/16/story/bitcoin-is-too-risky-for-public-fundscounterpoint",
            "url_media": "https://www.pressenterpriseonline.com/sites/all/themes/press_enterprise/images/services-print.jpg",
            "country": "US",
            "language": "en",
            "summary": "States should think twice before creating state strategic crypto reserves. New Hampshire's lawmakers have already done so.    - InsideSources.com and InsideSources’s source.com.  It's not the first time a state has created a strategic crypto reserve. "
        },
        {
            "published_date": "2025-05-18T07:00:00",
            "title": "Use bitcoins as a reservePOINT",
            "author": "news@pressenterprise.net",
            "url": "https://www.pressenterpriseonline.com/daily/051825/page/16/story/use-bitcoins-as-a-reservepoint",
            "url_media": "https://www.pressenterpriseonline.com/sites/all/themes/press_enterprise/images/services-print.jpg",
            "country": "US",
            "language": "en",
            "summary": "New Hampshire became the first state this month to authorize a strategic Bitcoin reserve. As the lead sponsor of this groundbreaking project, New Hampshire is the first to do so.    .      in InsideSources.com   and in Bitcoin.com."
        },
        {
            "published_date": "2025-05-18T06:51:51",
            "title": "Projected to 20x, priced under $0.10- MUTM stands out as top crypto to buy",
            "author": "Invezz",
            "url": "https://article.wn.com/view/2025/05/18/Projected_to_20x_priced_under_010_MUTM_stands_out_as_top_cry",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Investors are looking for earlier-stage assets with clear direction, smart tokenomics, and well-timed timing in the crypto markets. More traders are stepping away from overpriced tokens and are focusing on earlier stage assets with clearer direction and smart tokensomics."
        },
        {
            "published_date": "2025-05-18T06:51:51",
            "title": "Uniswap price analysis as Unichain volume, network fees jump",
            "author": "Invezz",
            "url": "https://article.wn.com/view/2025/05/18/Uniswap_price_analysis_as_Unichain_volume_network_fees_jump",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Uniswap price dropped below $6 on Sunday. UNI token dropped from this month's high of $7.5500 to $6.00. It has also tumbled by over 70% from its highest point in December despite some gains."
        },
        {
            "published_date": "2025-05-18T06:50:37",
            "title": "BNB Trades in Tight Range Amid Decreasing Volatility",
            "author": "AI Boost",
            "url": "https://news.yahoo.com/news/finance/news/bnb-trades-tight-range-amid-065037510.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/nidKMF9MQ_EneywMT10wMw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03Mzg-/https://media.zenfs.com/en/coindesk_75/f00e4aecadf4ccbd635fbe6849c03d25",
            "country": "US",
            "language": "en",
            "summary": "BNB traded within a narrow $9.67 range between $636.25 and $645.92 over the last 24 hours. In the last hour, BNB climbed from $641.21 to $643.09 (0.29% gain). Volume spikes occurred during upward moves at 01:54-01:55."
        },
        {
            "published_date": "2025-05-18T06:30:00",
            "title": "Best Cryptos to Watch in 2025-Here's Why These 4 Picks Are Poised to Lead",
            "author": "Tribune Online",
            "url": "https://tribuneonlineng.com/best-cryptos-to-watch-in-2025-heres-why-these-4-picks-are-poised-to-lead",
            "url_media": "https://tribuneonlineng.com/wp-content/uploads/2025/05/image-91.png",
            "country": "NG",
            "language": "en",
            "summary": "Qubetics, Render, Theta, and Avalanche are making headlines. Qubetics is transforming cross-border transactions into instant, borderless, and affordable processes. Render is capitalizing on one of the most in-demand assets in the digital age: computing power. Theta has positioned itself at the intersection of decentralization and media delivery."
        },
        {
            "published_date": "2025-05-18T06:26:00",
            "title": "Saudi Arabia Blockchain IoT Market Outlook to 2031 Converging Technologies Drive Smart Industry and Urban Transformation  May. 18, 2025 06:26",
            "author": "",
            "url": "https://www.taiwannews.com.tw/en/news/6113487",
            "url_media": "https://www.taiwannews.com.tw/assets/favicon-TN3.png",
            "country": "TW",
            "language": "en",
            "summary": "Saudi Arabia's market for blockchain and Internet of Things (IoT) is poised for long-term growth. Government-backed digitization efforts under Vision 2030, increasing demand for secure, transparent, and efficient data exchange, and momentum in smart city and industrial automation projects are driving the market."
        },
        {
            "published_date": "2025-05-18T06:22:52",
            "title": "Bitcoin Depot (NASDAQ:BTM) Raised to Strong-Buy at Northland Capmk",
            "author": "Editorial Team",
            "url": "https://reporter.am/2025/05/18/bitcoin-depot-nasdaqbtm-raised-to-strong-buy-at-northland-capmk.html",
            "url_media": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/bitcoin-depot-inc-logo-1200x675.png?v=20230815112432&w=240&h=240&zc=2",
            "country": "AM",
            "language": "en",
            "summary": "Bitcoin Depot (NASDAQ:BTM) was upgraded by Northland Capmk from a 'hold' to a 'strong-buy' rating. Northland Securities upgraded Bitcoin Depot to an 'outperform' rating and set a $5.00 target price for the company in a report on Friday. B Riley upped their target price on Bitcoin Depot from $4.70-$5.50 and gave the company a 'buy', while HC Wainwright restated a ' buy' rating on Tuesday, March 18th. COO Christopher Scott Buchanan sold 20,476 shares of the company's stock in a transaction on Thursday, April 3rd."
        },
        {
            "published_date": "2025-05-18T06:19:49",
            "title": "Cryptocurrency Markets Struggle as Bitcoin Holds Steady",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Cryptocurrency_Markets_Struggle_as_Bitcoin_Holds_Steady",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "ETH remains below $2,500 amid ongoing weekend market weakness. Bitcoin maintains stability, trading around $1,715.    \"Ether is down slightly, but it's still trading above $1.715.\"  \"Bitcoin is up slightly. It's still above $1000.\""
        },
        {
            "published_date": "2025-05-18T06:03:02",
            "title": "Coinbase Global (NASDAQ:COIN) Given New $301.00 Price Target at Benchmark",
            "author": "Editorial Team",
            "url": "https://reporter.am/2025/05/18/coinbase-global-nasdaqcoin-given-new-301-00-price-target-at-benchmark.html",
            "url_media": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/coinbase-global-inc-logo-1200x675.jpg?v=20210413172727&w=240&h=240&zc=2",
            "country": "AM",
            "language": "en",
            "summary": "Coinbase Global (NASDAQ:COIN) had its target price hoisted by analysts at Benchmark from $252 to $301.00. Benchmark's price objective indicates a potential upside of 12.96% from the company's current price. Piper Sandler increased their target price on Coinbase Global from $180.00 to $190.00 and gave the company a \"neutral\" rating. JMP Securities reissued a \"market outperform\" rating and issued a $400.00 target price for the company. Mizuho dropped their price target on the company from $280 to $217.00 in a research report on Tuesday, March 11th. "
        },
        {
            "published_date": "2025-05-18T05:56:50",
            "title": "AUSTRAC Fines Crypto Exchange Cointree for Reporting Failures",
            "author": "Bitcoin",
            "url": "https://article.wn.com/view/2025/05/18/AUSTRAC_Fines_Crypto_Exchange_Cointree_for_Reporting_Failure",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "The Australian Transaction Reports and Analysis Centre has issued infringement notices totaling $75,120 to cryptocurrency exchange Cointree for failing to comply with the law. Cointre did not comply with law and has been issued with infringement notices for not paying the fine.  "
        },
        {
            "published_date": "2025-05-18T05:19:49",
            "title": "XRP Price Braces For Rebound As BitMEX Teases Market-Moving Announcement",
            "author": "Coin Gape",
            "url": "https://article.wn.com/view/2025/05/18/XRP_Price_Braces_For_Rebound_As_BitMEX_Teases_MarketMoving_A",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "XRP has recovered its losses over the last week. BitMEX has ignited a further wave of optimism for a near-term correction in the cryptocurrency market.    - BitMex.  -  -      .  "
        },
        {
            "published_date": "2025-05-18T05:09:29",
            "title": "Bitcoin Price Today, May 18, 2025: BTC Price Steady at USD 1,03,000, Expected To Surge Above USD 1,20,000 Soon",
            "author": "Kalpeshkumar Patelia",
            "url": "https://www.latestly.com/socially/technology/bitcoin-price-today-may-18-2025-btc-price-steady-at-usd-103000-expected-to-surge-above-usd-120000-soon-6862853.html",
            "url_media": "https://st1.latestly.com/wp-content/uploads/2025/05/Bitcoin-Representational-Image-784x441.jpg",
            "country": "IN",
            "language": "en",
            "summary": "Bitcoin price has been steady since it crossed the USD 1,00,000 mark. Bitcoin price could reach a new high of $103,305.73 in 2025. Gold rate today, May 18, 2025: Gold Price Dips As Geopolitical Tensions Ease."
        },
        {
            "published_date": "2025-05-18T04:57:00",
            "title": "Hacker's luxury mansion, car seized in probe",
            "author": "",
            "url": "https://www.perthnow.com.au/news/crime/hackers-waterfront-home-mercedes-and-bitcoin-forfeited-in-cybercrime-probe-c-18732857",
            "url_media": "https://images.perthnow.com.au/publication/C-18732857/39d7f4906bf3114249c5cafb49166de6e2068ff1-16x9-x0y569w1475h830.jpg?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "A waterfront mansion, a luxury car and cryptocurrency worth $4.5m were seized by the AFP-led Criminal Assets Confiscation Taskforce (CACT) in a major cybercrime investigation. CACT used civil powers available under proceeds of crime laws to freeze and ultimately confiscate the assets. It was established in 2012 to proactively trace and confiscate criminal wealth. Since July 2019, the taskforce has restrained more than $1.2bn worth of criminal assets."
        },
        {
            "published_date": "2025-05-18T04:38:00",
            "title": "Hacker's waterfront home, Mercedes and Bitcoin forfeited in cybercrime probe",
            "author": "Andrew Hedgman",
            "url": "https://www.news.com.au/national/queensland/crime/hackers-waterfront-home-mercedes-and-bitcoin-forfeited-in-cybercrime-probe/news-story/938a6b7147642f353e96c4879a4fb54c",
            "url_media": "https://content.api.news/v3/images/bin/034e91d10d6187b78bf1c74af80466e9",
            "country": "AU",
            "language": "en",
            "summary": "A waterfront mansion, a luxury car and 25 Bitcoin worth more than $4.5m were seized by the AFP-led Criminal Assets Confiscation Taskforce (CACT) as suspected proceeds of crime linked to the theft of cryptocurrency and cyber hacking. CACT was established in 2012 to proactively trace and confiscate criminal wealth. The assets will be liquidated and the proceeds will go to the Commonwealth Confiscated Assets Account."
        },
        {
            "published_date": "2025-05-18T04:21:25",
            "title": "Ripple News: Why XRP Is Winning Institutional Trust?",
            "author": "",
            "url": "https://news.knowledia.com/all/all/articles/ripple-news-why-xrp-is-winning-institutional-trust-00ad668b49fb6c98c01ecf97453adf0fcecd487d",
            "url_media": "http://image.coinpedia.org/wp-content/uploads/2025/05/17192914/Ripple-News-Why-XRP-Is-Winning-Institutional-Trust.webp",
            "country": "FR",
            "language": "en",
            "summary": "Vignesh is a young journalist with a decade of experience. He spent six years as a Sub-Editor for a leading business magazine, published from Kerala. Now, he covers the crypto scene for Coinpedia. XRP confirms transactions in under 3 seconds and handles 1,500 TPS. Each transaction costs $0.00002."
        },
        {
            "published_date": "2025-05-18T04:21:25",
            "title": "Is Pi Network Dead? Pi Coin Price Crash Raises Concerns",
            "author": "",
            "url": "https://news.knowledia.com/all/all/articles/is-pi-network-dead-pi-coin-price-crash-raises-concerns-a688e262b8076adb0a1494eabbe3043f15e929c6",
            "url_media": "http://image.coinpedia.org/wp-content/uploads/2025/05/17192923/Is-Pi-Network-Dead-Pi-Coin-Price-Crash-Raises-Concerns-.png",
            "country": "FR",
            "language": "en",
            "summary": "Pi Coin tumbles 20% from $1.60 to $0.70 as Dr Altcoin accuses the Core Team of pre-mining, sidelining pioneers, and secret sell-offs. Mr Spock calls it FUD and expects a rebound. Pi Core Team may no longer need the community that helped build the network."
        },
        {
            "published_date": "2025-05-18T04:21:25",
            "title": "Panama City to Adopt Bitcoin Reserve Like El Salvador— Hints Mayor Mizrachi",
            "author": "",
            "url": "https://news.knowledia.com/all/all/articles/panama-city-to-adopt-bitcoin-reserve-like-el-salvador-hints-mayor-mizrachi-c53d263f98595fe902f6398dccfa667a823f32a0",
            "url_media": "http://image.coinpedia.org/wp-content/uploads/2025/05/17192927/Panama-City-to-Adopt-Bitcoin-Reserve-Like-El-Salvador%E2%80%94-Hints-Mayor-Mizrachi.webp",
            "country": "FR",
            "language": "en",
            "summary": "Panama City Mayor Mayer Mizrachi hints at a potential city-level Bitcoin reserve after key talks with El Salvador's crypto leaders. The city is interested in crypto tax payments, green mining via hydroelectric power, and financial education reforms inspired by El Salvador. The post comes 11 days before his scheduled Bitcoin 2025 speech in Las Vegas."
        },
        {
            "published_date": "2025-05-18T04:21:24",
            "title": "XRP Price Set to Explode on May 19th",
            "author": "",
            "url": "https://news.knowledia.com/all/all/articles/xrp-price-set-to-explode-on-may-19th-e44922e18e45593f5c99fb18d556c15da24cc463",
            "url_media": "http://image.coinpedia.org/wp-content/uploads/2025/05/02192442/Eric-Trumps-SWIFT-Comments-Spark-XRP-Surge-Whats-Next-1.webp",
            "country": "FR",
            "language": "en",
            "summary": "CME Group is launching XRP futures ETFs on May 19. Ripple CEO Brad Garlinghouse calls it an important step in the growth of the XRP market. There are over 80 crypto ETFs awaiting approval in the U.S., 20 of which are for XRP."
        },
        {
            "published_date": "2025-05-18T04:21:24",
            "title": "GENIUS Act Vote on May 19: Will the U.S. Finally Regulate Stablecoins?",
            "author": "",
            "url": "https://news.knowledia.com/all/all/articles/genius-act-vote-on-may-19-will-the-us-finally-regulate-stablecoins-e66e54a60a8f367c510cf449582f606690c3c1c5",
            "url_media": "http://image.coinpedia.org/wp-content/uploads/2025/05/12203455/Stablecoins-to-Hit-3.7-Trillion-by-2030-Says-Citi-Bank.webp",
            "country": "FR",
            "language": "en",
            "summary": "GENIUS Act is sponsored by Senator Bill Hagerty (R-TN) and Senator Kirsten Gillibrand (D-NY). It aims to establish the first-ever regulatory framework for payment stablecoins in the United States. It fell short of the 60-vote threshold required for cloture on May 8."
        },
        {
            "published_date": "2025-05-18T04:21:24",
            "title": "Cardano Price Prediction: ADA Targets 15% Surge Amid Technical Breakout Momentum, Cardano ETF Odds Hit 55%—Is XYZVerse Positioned to Outperform With 1.5x Growth?",
            "author": "",
            "url": "https://news.knowledia.com/all/all/articles/cardano-price-prediction-ada-targets-15-surge-amid-technical-breakout-e184058ec5cb0c82b477ff178f22e2925ba9fb56",
            "url_media": "http://image.coinpedia.org/wp-content/uploads/2025/05/12203257/crypto-70.jpg",
            "country": "FR",
            "language": "en",
            "summary": "XYZVerse has raised over $13 million during the presale phase of its ICO. The price of the $XYZ token currently stands at $0.003333. The team has not disclosed the details yet, but they have put a teaser for a big launch."
        },
        {
            "published_date": "2025-05-18T04:21:24",
            "title": "Will Crypto Pump or Dump This Weekend? Analyst Reveals Top Altcoin For 3x Gains",
            "author": "",
            "url": "https://news.knowledia.com/all/all/articles/will-crypto-pump-or-dump-this-weekend-analyst-reveals-top-altcoin-for-3x-deb119de5a7559c49dbbe299b50f2f49f0239edf",
            "url_media": "http://image.coinpedia.org/wp-content/uploads/2025/04/23192638/Top-Altcoins-Poised-to-Surge-as-Bitcoin-Dominance-Weakens.webp",
            "country": "FR",
            "language": "en",
            "summary": "Evan Aldo is a writer and researcher. He believes the market will either move sideways or pump over the weekend. If he were starting fresh in crypto today, Aldo would invest in Etherium instead of Bitcoin or Bitcoin Cash. He recommends to start with Etherium. "
        },
        {
            "published_date": "2025-05-18T04:21:24",
            "title": "Litecoin Price Prediction: $300 by 2025? Ozak AI's Rise Challenges Classic Altcoins",
            "author": "",
            "url": "https://news.knowledia.com/all/all/articles/litecoin-price-prediction-300-by-2025-ozak-ai-s-rise-challenges-2f83d3039e732c51d2ddd5256bf4f86d302ebedd",
            "url_media": "http://image.coinpedia.org/wp-content/uploads/2025/05/17222201/crypto-83.jpg",
            "country": "FR",
            "language": "en",
            "summary": "Litecoin currently trades between $90 and $100. Analysts have set near-term support levels around $75. Key resistance is placed close to $120, which Litecoin needs to smash to re-establish upward momentum. Long-term target of $300 by 2025 is possible, but it might require sustained market enthusiasm and macroeconomic tailwinds."
        },
        {
            "published_date": "2025-05-18T04:21:24",
            "title": "Worried About How Tariffs Will Impact Your Portfolio? Best Time to Hold XRP, DOGE, and This Crypto with 15029% Upside",
            "author": "",
            "url": "https://news.knowledia.com/all/all/articles/worried-about-how-tariffs-will-impact-your-portfolio-best-time-to-hold-12737d2ea7ee314b56de23cddf2c7b4d264c0899",
            "url_media": "http://coinpedia.org/wp-content/uploads/2025/05/AD_4nXcga-XTVt4n-KzhWyyHOrk4SoGDX1LiX-EUtlTfupYnSc-4nPqo7GTuGI3NFZOHkOZebS_ab1HACRdUBBRWQkEPoCS_aQJpFwwfmmeMwumVwuEKARS2CFlGmC2PegBaIHb3gSxZ.png",
            "country": "FR",
            "language": "en",
            "summary": "It's the best time to hold XRP, DOGE, and This Crypto with 15029% Upside. XRP is about to reach its previous highest price of $3.84, while future predictions show potential for a significant increase up to $7.77."
        },
        {
            "published_date": "2025-05-18T04:19:40",
            "title": "Creator of over 100 memecoins says rug pulls are the ‘easiest way to make money'",
            "author": "Cryptoslate",
            "url": "https://article.wn.com/view/2025/05/18/Creator_of_over_100_memecoins_says_rug_pulls_are_the_easiest",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Sahil Arora is the creator of memecoin. He claims to have earned millions of dollars from rug pull schemes. He says the easiest way to make money is to deploy a meme coin, run it, and then sell as soon as you see."
        },
        {
            "published_date": "2025-05-18T04:16:43",
            "title": "James Howells Relentlessly Hunts for Millions in Misplaced Bitcoin",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/James_Howells_Relentlessly_Hunts_for_Millions_in_Misplaced_B",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "James Howells lost a hard drive with 8,000 Bitcoins in 2013. Despite obstacles, he remains a successful businessman despite this.  He still has his hard drive and Bitcoins. He has no plans to give them back.       in the future."
        },
        {
            "published_date": "2025-05-18T03:53:18",
            "title": "Paris kidnap attempt puts EU crypto data laws under fire",
            "author": "",
            "url": "https://www.malaymail.com/news/tech-gadgets/2025/05/18/paris-kidnap-attempt-puts-eu-crypto-data-laws-under-fire/177181",
            "url_media": "https://www.malaymail.com/malaymail/uploads/images/2025/05/18/277556.png",
            "country": "MY",
            "language": "en",
            "summary": "New EU regulations threaten the security of the personal data of cryptocurrency users and expose them to 'physical danger', according to Paymium, the platform at the centre of last week's Paris kidnapping attempt. The rules require platforms to gather details about the beneficiary and transmit certain information about the customer to the receiving institution."
        },
        {
            "published_date": "2025-05-18T03:52:37",
            "title": "Beach mansion, Benz and Bitcoin worth $4.5m seized from League of Legends hacker Shane Stephen Duffy",
            "author": "Demi Huang",
            "url": "https://7news.com.au/news/beach-mansion-benz-and-bitcoin-worth-45m-seized-from-league-of-legends-hacker-shane-stephen-duffy-c-18731943",
            "url_media": "https://images.7news.com.au/publication/C-18731943/d8df9e977401f8a601dcfca6a3db72aa8c790b3f-16x9-x0y0w1280h720.png?imwidth=1200",
            "country": "AU",
            "language": "en",
            "summary": "Luxury assets worth more than $4.5 million have been forfeited after being linked to a previously convicted Queensland hacker. The haul includes a beachfront mansion, a 2019 black Mercedes-Benz sedan and nearly 25 Bitcoin. Shane Stephen Duffy was previously convicted of hacking Riot Games, the US-based gaming company behind the hit video game League of Legends. He was sentenced to two-and-a-half years in jail."
        },
        {
            "published_date": "2025-05-18T03:30:00",
            "title": "Walletless blockchain-based decentralised applications",
            "author": "Times",
            "url": "https://timesofmalta.com/article/walletless-blockchainbased-decentralised-applications.1109717",
            "url_media": "https://cdn-attachments.timesofmalta.com/4380ca0b0688516d3fbefacb881172f8c67eebc8-1747297965-4b3fd9b8-1200x630.jpg",
            "country": "MT",
            "language": "en",
            "summary": "Joshua Ellul and Gordon J. Pace are professors at the Department of Computer Science, Faculty of ICT, University of Malta. They explored 'walletless' techniques to make decentralised applications (dApps) more user-friendly. They used the VinoVeritas project – co-funded by the European Union."
        },
        {
            "published_date": "2025-05-18T03:12:27",
            "title": "Paris kidnap bid highlights crypto data security risks",
            "author": "Lucie LEQUIER",
            "url": "https://www.yahoo.com/news/paris-kidnap-bid-highlights-crypto-031227733.html",
            "url_media": "https://media.zenfs.com/en/afp.com/573b2a6685e3aeaee4227f83c18a25c0",
            "country": "US",
            "language": "en",
            "summary": "New EU regulations threaten the security of the personal data of cryptocurrency users, according to French platform Paymium. The platform at the centre of last week's Paris kidnapping attempt has urged authorities to reinforce the protection of companies within the sector. Since 2014, software developer Jameson Lopp has recorded 219 physical attacks targeting cryptocurrency users."
        },
        {
            "published_date": "2025-05-18T03:00:20",
            "title": "Ethereum (ETH) Is Holding at $2.480 Support Level, But Analysts Suggest Ruvi AI (RUVI) As The Next 100x Crypto Gem to turn $600 into $160,000",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/markets/ethereum-eth-is-holding-at-2-480-support-level-but-analysts-suggest-ruvi-ai-ruvi-as-the-next-100x-crypto-gem-to-turn-600-into-160-000/ar-AA1EYPfS",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Ruvi is a cutting-edge project that combines artificial intelligence with blockchain technology. Phase 1 of the presale sold out in just over two weeks, giving early investors a 50% return on their investment. The token is currently priced at $0.015, but the next phase features a 0.33% price increment. Ruvi's tailored investment tiers allow participants to maximize their gains."
        },
        {
            "published_date": "2025-05-18T03:00:08",
            "title": "Could Basel III Endgame Drive Gold to $6,000?",
            "author": "from",
            "url": "https://www.sgtreport.com/2025/05/could-basel-iii-endgame-drive-gold-to-6000",
            "url_media": "https://cdn-ilcknkl.nitrocdn.com/EVXYJhTqbjcFrBfKCDCtJHoclSEpwVSP/assets/images/optimized/rev-10d7c72/www.birchgold.com/wp-content/uploads/2025/05/basel-iii-endgame-gold-6000.jpg",
            "country": "US",
            "language": "en",
            "summary": "Experts target $6,000 gold as Basel III comes closer to realization. Goldman Sachs forecasts $3,800-$4,500 by the end of 2025. The gold/silver ratio has always measured silver's fair value price compared to gold, but it's risen further in the last year."
        },
        {
            "published_date": "2025-05-18T02:56:37",
            "title": "Arthur Hayes: Bitcoin to Hit $1M Amid Capital Flight, US Treasuries Crash",
            "author": "Bitcoin",
            "url": "https://article.wn.com/view/2025/05/18/Arthur_Hayes_Bitcoin_to_Hit_1M_Amid_Capital_Flight_US_Treasu",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Arthur Hayes predicts an unstoppable surge for bitcoin as collapsing U.S. treasuries and capital repatriation fuel a global flight into the currency. He predicts it will be worth $20,000 or more in a few years.   -   "
        },
        {
            "published_date": "2025-05-18T02:15:39",
            "title": "Arthur Hayes Predicts a Significant Bitcoin Surge",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Arthur_Hayes_Predicts_a_Significant_Bitcoin_Surge",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Arthur Hayes predicts a significant rise in Bitcoin prices during the summer months, especially during the rise in the value of the Bitcoin currency. He is also predicting a rise in gold prices as well.    for the whole year. For more information, visit: www.ahayes.com."
        },
        {
            "published_date": "2025-05-18T02:12:43",
            "title": "Get rich quick crypto ‘gurus' are targeting teens and fleecing them through ‘rug pulling'",
            "author": "New York Post",
            "url": "https://article.wn.com/view/2025/05/18/get_rich_quick_crypto_8216gurus_8217_are_targeting_teens_and",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Cryptocurrency titans make it seem easy for anyone to get rich off digital coins. The easiest way to make money is to deploy a meme coin, run it and then sell as soon as you see. There are almost no regulations or laws in crypto."
        },
        {
            "published_date": "2025-05-18T02:03:54",
            "title": "Xode Blockchain joins Token 2049 Dubai, breaks record",
            "author": "Caesar Ditan",
            "url": "https://www.sunstar.com.ph/cebu/xode-blockchain-joins-token-2049-dubai-breaks-record-with-2-listings",
            "url_media": "https://media.assettype.com/sunstar%2F2025-05-18%2Fxoio3851%2FXode-1.jpg?rect=0%2C22%2C750%2C394&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
            "country": "PH",
            "language": "en",
            "summary": "Xode has joined Token 2049 Dubai, the biggest cryptocurrency event in the United Arab Emirates. The biggest names in crypto gathered at the event, including Binance founder CZ, Robert Mitchnick of Blackrock, Star Xu of OKX, Paolo Ardoino of Tether, Justin Sun, founder of Tron, Eric Trump of the Trump Organization, Blackstone and FM - First Metro from South Korea, and Alex Morozov from Serbia joined the delegation. On Tuesday, April 29, Xode CMO Caesar Ditan spoke at the Polkadot Side Event @Token2049 Dubai. "
        },
        {
            "published_date": "2025-05-18T02:00:04",
            "title": "Top 5 Altcoins to Watch This Weekend: SOL, XRP, AVAX, and More",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/markets/top-5-altcoins-to-watch-this-weekend-sol-xrp-avax-and-more/ar-AA1EYyNI",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "MAGACOIN FINANCE is leading the list of Top 5 altcoins to keep an eye on this weekend. Solana, XRP, Avalanche, and other legacy altcoins are trying to hold breakout zones, but attention is rapidly shifting toward fresh narratives, timing-based plays, and asymmetric reward setups."
        },
        {
            "published_date": "2025-05-18T01:47:20",
            "title": "Co-founder of crypto game Blum arrested in Moscow on large-scale fraud charges",
            "author": "TASS",
            "url": "https://tass.com/emergencies/1959629",
            "url_media": "https://tass.com/img/blocks/common/tass_logo_share_eng.png",
            "country": "RU",
            "language": "en",
            "summary": "Vladimir Smerkis, former head of Binance in the CIS and co-founder of the crypto game Blum, has been arrested in connection with a criminal investigation into large-scale fraud. The Zamoskvoretsky District Court of Moscow has ordered the arrest."
        },
        {
            "published_date": "2025-05-18T01:30:11",
            "title": "Bitcoin, Ethereum, Dogecoin Climb Ahead Of Weekend — XRP Lags Behind",
            "author": "Khyathi Dalal",
            "url": "https://finance.yahoo.com/news/bitcoin-ethereum-dogecoin-climb-ahead-013011833.html",
            "url_media": "https://media.zenfs.com/en/benzinga_79/0b723c5fbe43279216aef917486893cd",
            "country": "US",
            "language": "en",
            "summary": "Major cryptocurrencies are trending higher early Friday, signaling renewed investor optimism heading into the weekend. Data shows Bitcoin and ETH transaction volume increased 5.4% and 1.3%, respectively, while Bitcoin's daily active addresses are down 6.3%. 123,626 traders liquidated in the past 24 hours for $340 million."
        },
        {
            "published_date": "2025-05-18T01:30:02",
            "title": "Fear, anger in France's crypto community after spate of kidnappings",
            "author": "Elizabeth Howcroft",
            "url": "https://www.nst.com.my/opinion/columnists/2025/05/1217708/fear-anger-frances-crypto-community-after-spate-kidnappings",
            "url_media": "https://assets.nst.com.my/images/articles/FINTECH-CRYPTO_GALAXY-DIGITAL_1747531788.jpg",
            "country": "MY",
            "language": "en",
            "summary": "There have been several kidnappings of prominent French crypto executives in recent months. The daughter of Pierre Noizat, CEO of Paymium, was attacked on a Paris street during a botched kidnapping on Tuesday. The interior minister met with some crypto bosses on Friday and offered \"full mobilisation of public authorities\""
        },
        {
            "published_date": "2025-05-18T01:25:35",
            "title": "Ethereum Looks Primed To Outperform Bitcoin In Coming Months — Altseason Incoming?",
            "author": "Bitcoinist",
            "url": "https://article.wn.com/view/2025/05/18/Ethereum_Looks_Primed_To_Outperform_Bitcoin_In_Coming_Months",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "Ether's price briefly touched $2,700 for the first time in nearly three months on Tuesday, May 13. The altcoin has slowed down at the start of the weekend, but it's still above the $1,700 level.   "
        },
        {
            "published_date": "2025-05-18T01:13:31",
            "title": "Is Bitcoin Bull Run Back? Daily RSI Shows Only Mild Bullish Momentum",
            "author": "News BTC",
            "url": "https://article.wn.com/view/2025/05/18/Is_Bitcoin_Bull_Run_Back_Daily_RSI_Shows_Only_Mild_Bullish_M",
            "url_media": "https://article.wn.com/view/2025/05/18/[]",
            "country": "US",
            "language": "en",
            "summary": "The price of Bitcoin has risen from $85,000 to $104,700 over the past month. The largest cryptocurrency market enjoyed a positive shift in investor sentiment and a positive trend in the market since mid-April. Bitcoin is the world's largest cryptocurrency."
        },
        {
            "published_date": "2025-05-18T01:03:45",
            "title": "Recovery of Lost Funds Through \\\\ Folkwin Expert Recovery",
            "author": "",
            "url": "https://news.knowledia.com/all/all/articles/recovery-of-lost-funds-through-folkwin-expert-recovery-45a270aca5877467a7148caa018840b2a2d12aae",
            "url_media": "https://news.ycombinator.com/y18.svg",
            "country": "FR",
            "language": "en",
            "summary": "There is an alarming rise in crypto-related fraud. If you've fallen victim to a scam, gather all transaction details, wallet addresses, transaction IDs, screenshots and any communication with the scammers. This documentation will serve as key evidence in your efforts to recover the stolen assets. Seek professional help."
        },
        {
            "published_date": "2025-05-18T01:00:30",
            "title": "Bitcoin (BTC) Climbs to 103.000$ this Week, But Ruvi AI (RUVI) Redefines Investing by Offering 100% Early Bonus and 20,000% Growth Potential",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/other/bitcoin-btc-climbs-to-103-000-this-week-but-ruvi-ai-ruvi-redefines-investing-by-offering-100-early-bonus-and-20-000-growth-potential/ar-AA1EYMnE",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Ruvi is a project blending blockchain and AI to create unprecedented opportunities. Phase 1 sold out in just over two weeks, rewarding early investors with a 50% gain. The next phase of the presale will introduce a 0.33% increment in token price. Ruvi offers investment tiers uniquely designed to maximize gains for participants."
        },
        {
            "published_date": "2025-05-18T01:00:00",
            "title": "Severed Fingers and ‘Wrench Attacks' Rattle the Crypto Elite",
            "author": "Sam Schechner",
            "url": "https://www.msn.com/en-us/money/technology/severed-fingers-and-wrench-attacks-rattle-the-crypto-elite/ar-AA1EYvYC",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "A 34-year-old woman whose father runs Paymium, a French cryptocurrency exchange, was abducted early Tuesday morning by three men in black masks. Her husband tried to stop them, but they fled in a white van disguised as a delivery truck. The attack is the latest in a wave of violent abductions around the world, including several in the U.S., targeting crypto executives and their families."
        },
        {
            "published_date": "2025-05-18T01:00:00",
            "title": "Botched Kidnapping Attempt in Paris as Criminals Target Crypto Wealth",
            "author": "WSJ",
            "url": "https://finance.yahoo.com/video/botched-kidnapping-attempt-paris-criminals-010000855.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/5RoAKt2CGBIgP3.5MNcleA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/wall_street_journal_733/d187a3435700bc2b0bf9d24de5808f86",
            "country": "US",
            "language": "en",
            "summary": "Men in masks tried to force victims into the back of a van on a Paris street in broad daylight. This is the latest incident in a recent crime wave targeting crypto executives and their families in recent weeks. The suspects were dressed in masks.    "
        },
        {
            "published_date": "2025-05-18T01:00:00",
            "title": "Botched Kidnapping Attempt in Paris as Criminals Target Crypto Wealth",
            "author": "WSJ",
            "url": "https://ca.finance.yahoo.com/video/botched-kidnapping-attempt-paris-criminals-010000855.html",
            "url_media": "https://s.yimg.com/ny/api/res/1.2/5RoAKt2CGBIgP3.5MNcleA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/wall_street_journal_733/d187a3435700bc2b0bf9d24de5808f86",
            "country": "US",
            "language": "en",
            "summary": "Men in masks tried to force victims into the back of a van on a Paris street in broad daylight. This is the latest incident in a crime wave targeting crypto executives and their families. There was an error retrieving data from a portfolio, so it took some time to access it."
        },
        {
            "published_date": "2025-05-18T01:00:00",
            "title": "Severed Fingers and ‘Wrench Attacks' Rattle the Crypto Elite",
            "author": "Sam Schechner",
            "url": "https://www.wsj.com/finance/currencies/crypto-industry-robberies-attacks-32c2867a",
            "url_media": "https://images.wsj.net/im-17622319/social",
            "country": "US",
            "language": "en",
            "summary": "Three men in black masks jumped on a 34-year-old woman whose father runs Paymium, a French cryptocurrency exchange. The masked men tried to force the woman and her toddler into an idling white van disguised as a delivery truck. The woman's screams echoed down the street."
        },
        {
            "published_date": "2025-05-18T00:43:33",
            "title": "M&S and Co-Op: BBC reporter on talking to the hackers",
            "author": "Joe Tidy",
            "url": "https://www.bbc.com/news/articles/cgr5nen5gxyo",
            "url_media": "https://ichef.bbci.co.uk/news/1024/branded_news/32a1/live/12a73350-3316-11f0-b8af-5feabbf4b0ee.png",
            "country": "GB",
            "language": "en",
            "summary": "BBC's Joe Tidy is reporting on the recent cyber attacks on M&S and Co-op. The hackers are from a cyber crime service called DragonForce. DragonForce offers cyber criminal affiliates various services on their darknet site in exchange for a 20% cut of any ransoms collected."
        },
        {
            "published_date": "2025-05-18T00:43:14",
            "title": "Rich Dad Poor Dad has a shocking warning for ‘Marxist central bank'",
            "author": "Mehab Qureshi",
            "url": "https://finance.yahoo.com/news/rich-dad-poor-dad-shocking-004314417.html",
            "url_media": "https://media.zenfs.com/en/thestreet_881/48e748d650fbd2bbb46f85a5407e499a",
            "country": "US",
            "language": "en",
            "summary": "Robert Kiyosaki predicts Bitcoin will reach $250,000 by the end of 2025. Bitcoin is trading at $103,278 at the time of writing, up 0.4% in the last 24 hours. It has gained 7.2% in past two weeks and 21.4%."
        },
        {
            "published_date": "2025-05-18T00:30:09",
            "title": "Jim Chanos Goes Long Bitcoin, Short MicroStrategy In Arbitrage Bet Against Retail Speculation",
            "author": "Murtuza J Merchant",
            "url": "https://finance.yahoo.com/news/jim-chanos-goes-long-bitcoin-003009302.html",
            "url_media": "https://media.zenfs.com/en/benzinga_79/c9d75be98e0bf76e511cbd3cb848fc9b",
            "country": "US",
            "language": "en",
            "summary": "Jim Chanos goes long Bitcoin and short Strategy as an arbitrage trade. He is buying Bitcoin for $1 and selling Strategy's stock for $2.50. Chanos believes MicroStrategy's stock has an unjustified premium relative to its Bitcoin holdings."
        },
        {
            "published_date": "2025-05-18T00:30:00",
            "title": "Graid Technology to Showcase Next-Generation Data Protection Solutions at COMPUTEX 2025",
            "author": "美通社",
            "url": "https://portal.sina.com.hk/finance/finance-prnewswire/prnasia/2025/05/18/1188790/graid-technology-to-showcase-next-generation-data-protection-solutions-at-computex-2025",
            "url_media": "https://mma.prnasia.com/media2/2690061/Computex_2025__3.jpg?p=medium600",
            "country": "HK",
            "language": "en",
            "summary": "Graid Technology Inc. will showcase its latest innovations at COMPUTEX Taipei 2025 from May 20-23. Its flagship product SupremeRAID is the world's first GPU-based RAID solution for NVMe and NVMeoF. Supreme100 Edge Workstation is an edge computing workstation engineered for high-intensity workloads. SupremeStore HPC Cluster Storage is the first dual-controller HA capability in a single device. GAC made a powerful debut at the Malaysia Autoshow 2025 at MAEPS with a new lineup of five models."
        },
        {
            "published_date": "2025-05-18T00:17:35",
            "title": "Could Ruvi AI (RUVI) Be the Next Shiba Inu (SHIB)? Analysts Suggest it Will Skyrocket by 20,000% During Altcoin Season",
            "author": "Becky",
            "url": "https://www.msn.com/en-us/money/other/could-ruvi-ai-ruvi-be-the-next-shiba-inu-shib-analysts-suggest-it-will-skyrocket-by-20-000-during-altcoin-season/ar-AA1EYA2Q",
            "url_media": "",
            "country": "US",
            "language": "en",
            "summary": "Shiba Inu (SHIB) is trading at $0.000014. Ruvi is an innovative platform merging AI and blockchain technology. Phase 1 of the presale sold out in just over two weeks. Early investors enjoyed a 50% gain during this stage. "
        },
        {
            "published_date": "2025-05-18T00:11:00",
            "title": "Conor M. Power: Not normal and will not end well",
            "author": "",
            "url": "https://www.recorder.com/Letter-60759737",
            "url_media": "https://www.recorder.com//attachments/32/50224532.jpg",
            "country": "US",
            "language": "en",
            "summary": "Donald Trump is corrupt and inept, writes Conor Power Montague. Trump created a meme coin that allows anyone who curries Trump's favor to purchase his coins. Trump bragged about how his billionaire friends made millions. Trump proposed bailing out our farmers by billing the taxpayers $25 billion for his mistake."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Ethereum and PEPE: Who dominates the market after Bitcoin's decline?",
            "author": "The Bitcoin News",
            "url": "https://article.wn.com/view/2025/05/18/ethereum_and_pepe_who_dominates_the_market_after_bitcoin_821",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Etium and PEPE have become major players in the cryptocurrency world. Bitcoin's decline has set the stage for their development. PEPe is exhibiting a volatile pattern, suggesting a possible upcoming rally in the market.       in the dynamic world of cryptocurrencies."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Severed Fingers and ‘Wrench Attacks' Rattle the Crypto Elite",
            "author": "Wall Street Journal",
            "url": "https://article.wn.com/view/2025/05/18/severed_fingers_and_x2018wrench_attacks_x2019_rattle_the_cry",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "As bitcoin soars, investors and executives are taking their swollen digital wallets offline for safety as they fear criminals are coming after them violently.    “Criminals’s coming after” is a common phrase used to refer to those who want to withdraw money from a digital wallet."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin's cool-off results in Ethereum vs. PEPE: Here's why, and who's winning",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_s_cooloff_results_in_Ethereum_vs_PEPE_Here_s_why_and",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": " is reloading for a sharp breakout that outpaces ETH in the next cycle. PEPE could be on the way to a sharp breakaway.   for ETH in next cycle?    PEPe.  EPEP.  ETH. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Retro game MapleStory reinvents itself on blockchain",
            "author": "Korea Times",
            "url": "https://article.wn.com/view/2025/05/18/Retro_game_MapleStory_reinvents_itself_on_blockchain",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "MapleStory has reinvented its ecosystem through blockchain technology. The new endeavor by game developer Nexon is drawing attention to whether it can succeed, industry officials said Sunday. Many Web3 games have fallen short of expectations and are fading away, but this new venture by Nexon draws attention."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Is History Repeating Itself in Bitcoin? Analysis Company Predicts BTC's Movement in the Coming Days ...",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Is_History_Repeating_Itself_in_Bitcoin_Analysis_Company_Pred",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Alphractal has reviewed the status of Bitcoin in its latest report. It is based on the analysis provided by Alphractal's partner, the Cryptocurrency Analysis Company (CACO). It is not yet clear what the future holds for Bitcoin."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Best Crypto Presale to Buy: As Altcoins Rise, Presales May Offer the Best Entry Point",
            "author": "Brave New Coin",
            "url": "https://article.wn.com/view/2025/05/18/Best_Crypto_Presale_to_Buy_As_Altcoins_Rise_Presales_May_Off",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Ukraine is reportedly on the cusp of finalizing legislation to establish a national Bitcoin reserve. Binance is on board. For individual investors, that trend highlights the potential of early-stage projects like Dawgz AI. They combine AI with Bitcoin.    "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Expert Predicts Bitcoin Dominance As Scientists Create Lab-Grown Gold",
            "author": "Coin Gape",
            "url": "https://article.wn.com/view/2025/05/18/Expert_Predicts_Bitcoin_Dominance_As_Scientists_Create_LabGr",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "CNBC trader Ran Neuner argues that Bitcoin will be the winner over bullion in the race to become the ultimate safe-haven asset. CERN scientists are transforming lead into gold as part of their experiment at CERN. The experiment is threatening the long-term value of gold."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin's $10,000 Stairway: Chart Signals March Toward $115,000",
            "author": "News BTC",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_s_10000_Stairway_Chart_Signals_March_Toward_115000",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "In the last week, Bitcoin prices oscillated between $105,000 and $101,000 to produce a slight gain of 0.60%. Bitcoin has seen a market cool-off in the past two weeks following a 10.7% price leap in early May."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Top crypto price predictions: Onyxcoin (XCN), Dogwifhat (WIF), Litecoin",
            "author": "Invezz",
            "url": "https://article.wn.com/view/2025/05/18/Top_crypto_price_predictions_Onyxcoin_XCN_Dogwifhat_WIF_Lite",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The market cap of all cryptocurrencies has dropped by over 3% in the last few days to $3 trillion. Bitcoin has stagnated below $105,000. This article provides a forecast for top altcoins like Onyxcoin (XCN), Dogwifhat (WIF), and Onyx."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Despite BTC criticism: Warren Buffett makes $250 million with crypto companies",
            "author": "The Bitcoin News",
            "url": "https://article.wn.com/view/2025/05/18/Despite_BTC_criticism_Warren_Buffett_makes_250_million_with_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Warren Buffet invested in Brazilian Nubank, a company that facilitates Bitcoin trading but also holds it on its balance sheet. He once called the digital currency 'rat poison squared' but that didn't stop him from investing in it. Now Warren Buffet's Berkshire has invested in it as well."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Crypto Market News: One Final Dip Before Altseason Explosion, Analyst Predicts",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Crypto_Market_News_One_Final_Dip_Before_Altseason_Explosion_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The crypto market might be getting ready for one last dip before prices take off. Analysts are keeping a close eye on the market now.      http://www.coinpedia.com/news/crypto-market-news/altseason-explosion-predicts-analyst."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Trump accused of committing ‘single most corrupt, self-serving act of any President in American history'",
            "author": "Penn Live",
            "url": "https://article.wn.com/view/2025/05/18/Trump_accused_of_committing_single_most_corrupt_selfserving_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Sen. Adam Schiff (D-Calif.) spent the week taking Donald Trump to task on what he called outrageous corruption. Trump's meme coin is the one thing that stands out above all else, because it invites cash payments from whoever needs to buy influence, according to Schiff."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Robert Kiyosaki's Bitcoin Advice: ‘Buy More, Do Not Sell'—BTC to Hit $250K This Year",
            "author": "Bitcoin",
            "url": "https://article.wn.com/view/2025/05/18/Robert_Kiyosaki_s_Bitcoin_Advice_Buy_More_Do_Not_Sell_BTC_to",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Robert Kiyosaki predicts bitcoin will soar to $250,000 this year as crashing central banks trigger mass bankruptcies, fueling bitcoin's growth.   .    in his article, he also says that bitcoin's value will rise to $500,000. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Golden Ratio Multiplier Called Bitcoin Top In 2021 – Here's What It's Saying Now",
            "author": "News BTC",
            "url": "https://article.wn.com/view/2025/05/18/golden_ratio_multiplier_called_bitcoin_top_in_2021_8211_here",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin is still trading around the $103,000 mark. The upward momentum it started in May has exhibited a slowdown in the past seven days. Some analysts are looking to long-term cycle indicators for Bitcoin's future direction. Bitcoin hit its cycle top level in March 2024."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Dogecoin Moves Into Demand Zone After 10% Fallout – Is A Bounce Coming?",
            "author": "Bitcoinist",
            "url": "https://article.wn.com/view/2025/05/18/dogecoin_moves_into_demand_zone_after_10_fallout_8211_is_a_b",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": " (DOGE) has experienced a 10% drop from former highs. The meme coin is poised for a short-term recovery to new levels if the daily price low holds, according to DD Trading On X (DD Trading OnX) analyst.  "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin, a beachside mansion and a Mercedes Benz: QLD man forfeits more than $4.5 million in assets as suspected proceeds of crime (AFP - Australian Federal Police)",
            "author": "Public Technologies",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_a_beachside_mansion_and_a_Mercedes_Benz_QLD_man_forf",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The AFP-led Criminal Assets Confiscation Taskforce has secured the forfeiture of more than $4.5 million worth of assets, including a Queensland waterfront mansion, luxury car and Bitcoin, after identifying the owners. The photos of the home and the car are available via Hightail."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Is It Too Late to Buy Bitcoin? Michael Saylor Offers Perspective on Long-Term Value",
            "author": "Coin Edition",
            "url": "https://article.wn.com/view/2025/05/18/Is_It_Too_Late_to_Buy_Bitcoin_Michael_Saylor_Offers_Perspect",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "$950T in assets may shift as Bitcoin outperforms traditional stores of value. Bitcoin's adoption mirrors the rise of key economic hubs like New York City. Michael Saylor, Executive Chairman of Strategy, recently said Bitcoin is digital real estate within the most secure global network."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Jan 2024 SEC's X account hacker got 14 months in prison for cyber fraud",
            "author": "Cryptoslate",
            "url": "https://article.wn.com/view/2025/05/18/Jan_2024_SEC_s_X_account_hacker_got_14_months_in_prison_for_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Eric Council Jr. was sentenced to 14 months' imprisonment for his role in the Jan. 9, 2024, hack of the U.S. Securities and Exchange Commission's (SEC's) X account. Council and co-conspirators posted false news of the SEC approving the first Bitcoin (BTC) exchange-traded fund."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "UK to require crypto firms to report every customer transaction",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/UK_to_require_crypto_firms_to_report_every_customer_transact",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "UK crypto companies will have to collect and report data from every customer trade and transfer beginning Jan. 1, 2026 as part of an effort to improve crypto tax reporting. Everything from the user's account details will be collected and reported to the UK government. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin Price Rally Pauses at $103K as Trump Issues New Updates on Russia War and ...",
            "author": "Coin Gape",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Price_Rally_Pauses_at_103K_as_Trump_Issues_New_Updat",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin price finds steady support at the $103,110 mark on Saturday, May 17. Trump's bold policy statements provided directional hints around Fed cuts and geopolitical risks. Bitcoin closed marginally lower on Friday at $100,110 on Friday, May 16th. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin (BTC) Outlook: Bullish as Blackrock's Spot ETF Inflows Extend for Fifth Week",
            "author": "FX Empire",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_BTC_Outlook_Bullish_as_Blackrock_s_Spot_ETF_Inflows_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "BTC trades above $100K despite weekend losses, supported by the weekend losses.   Â   $100k is the current market value of BTC trades. Â $100,000 is the average trading value of the BTC market share at the moment."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "How US Crypto Firms Navigate Trump's New Playbook",
            "author": "Sean Lee",
            "url": "https://www.forbes.com/sites/digital-assets/2025/05/18/how-us-crypto-firms-navigate-trumps-new-playbook",
            "url_media": "https://imageio.forbes.com/specials-images/imageserve/6829fefe76e21c0c105787cc/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
            "country": "US",
            "language": "en",
            "summary": "As US policymakers push for structure, the industry faces a moment that could unlock scale, capital and global relevance. President Trump signed an executive order to create a Strategic Bitcoin Reserve. SEC reorganized its crypto oversight efforts into the Cyber and Emerging Technology Unit and launched a task force to develop a clear regulatory framework. Uminers CEO Batyr Hydyrov sees the SEC's updated stance on proof-of-work mining as a catalyst."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Ethereum Price Crosses $2,550 as Saudi Central Bank Buys 25,656 Shares of Strategy amid Trump's Visit",
            "author": "Coin Gape",
            "url": "https://article.wn.com/view/2025/05/18/Ethereum_Price_Crosses_2550_as_Saudi_Central_Bank_Buys_25656",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Ethereum price surged 3% to reclaim $2,550 on Sunday, May 18, driven by renewed investor interest following Bitcoin's breakout and Saudi-linked institutional activity. It had briefly dipped to $2.462 over the previous day. It has since recovered to $3,550."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Move Over Cardano: 3 Explosive New Crypto Picks",
            "author": "Bitcoinist",
            "url": "https://article.wn.com/view/2025/05/18/Move_Over_Cardano_3_Explosive_New_Crypto_Picks",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Cardano is back in the headlines with fresh price predictions suggesting it could hit $10 by 2031. Bitcoin is aiming for the $120K mark. Dogecoin whales are on the dogecoin. Market watchers are calling for an altcoin season revival."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Donald Trump Says The Market Is Going To Go Higher As Institutions Accumulate Ethereum Below $3,000",
            "author": "Coin Edition",
            "url": "https://article.wn.com/view/2025/05/18/Donald_Trump_Says_The_Market_Is_Going_To_Go_Higher_As_Instit",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "US President Donald Trump claims the market is primed for another big run. Behind the scenes, institutions have been quietly loading up on Etherium (ETH) under $3,000, anticipating a breakout. But the real rival is Bitcoin (BCT) which is worth more than $10,000."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Why Did the Rally in Ethereum Stop? Expert Analyst Predicts the Future of Bitcoin and ...",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Why_Did_the_Rally_in_Ethereum_Stop_Expert_Analyst_Predicts_t",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "An experienced analyst from Coinbase shares his assessment of the recent rally in ETH and Bitcoin. He predicts the future of Bitcoin and ETH in his article \"Why Did the Rally in ETH Stop? Expert Analyst Predicts the Future of Bitcoin in the article \"What is expected from Bitcoin?\""
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Big Bitcoin Bet as BTC Whale Doubles Down With $393 Million Long Position",
            "author": "Crypto Potato",
            "url": "https://article.wn.com/view/2025/05/18/Big_Bitcoin_Bet_as_BTC_Whale_Doubles_Down_With_393_Million_L",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "On-chain data reveals that an unknown large market participant has opened a few long positions for bitcoin with an average price of just over $103,000. Live data from Hyperliquid's live feed shows that the liquidation price is set at $95,576."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Predicting Bitcoin's Rise: Analyst Scott Melker Believes $250K By 2025 Is Achievable",
            "author": "MENA FN",
            "url": "https://article.wn.com/view/2025/05/18/Predicting_Bitcoins_Rise_Analyst_Scott_Melker_Believes_250K_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Scott Melker predicts Bitcoin could reach $250,000 by 2025. He is known as \"The Wolf of All Streets\" and \"Crypto Breaking\" on Menafn.       .   in a recent interview. He expressed his optimistic outlook on Bitcoin. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Are Bitcoin Mining Stocks Mispriced? Here's What On-Chain Data Is Telling Investors",
            "author": "Crypto Potato",
            "url": "https://article.wn.com/view/2025/05/18/Are_Bitcoin_Mining_Stocks_Mispriced_Here_s_What_OnChain_Data",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "CryptoQuant has unveiled a framework for monitoring the revenues of leading public Bitcoin mining companies. This methodology tells whether the companies are undervalued or overvalued in real time, according to the latest weekly report from the on-chain intelligence platform. The framework tracks miners' revenues."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Partner at $56,300,000,000 Venture Capital Firm Has Phone Number, Address and Other Details Stolen in ...",
            "author": "The Daily Hodl",
            "url": "https://article.wn.com/view/2025/05/18/Partner_at_56300000000_Venture_Capital_Firm_Has_Phone_Number",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The thieves responsible for the recent security breach of US-based crypto exchange Coinbase have reportedly obtained the personal information of a managing partner at Sequoia Capital, the $56.3 billion venture capital giant. In a report submitted to the U.S. Securities and Exchange Commission (SEC) on May 14th, the SEC reported that the information was obtained."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin retakes $105,000, now only 3.5% from a new all-time high",
            "author": "Cryptopolitan",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_retakes_105000_now_only_35_from_a_new_alltime_high",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin broke through $105,000 on Monday. The coin is currently trading at $103,592. Bitcoin will be the best-performing asset during this period of global monetary transformation, according to CoinGecko. Bitcoin's previous all-time high of $109,114 was reached in May."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "How The Public Internet Hinders Blockchain Technology: Insights From Doublezero CEO",
            "author": "MENA FN",
            "url": "https://article.wn.com/view/2025/05/18/How_The_Public_Internet_Hinders_Blockchain_Technology_Insigh",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The internet is experiencing a bottleneck due to the increasing popularity of blockchain networks. This phenomenon, also known as the public internet bottleneck, has created a problem for the internet users.   Crypto Breaking is on tonight at 10 p.m. ET. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Tariffs will push people deeper into digital worlds, says Animoca co-founder",
            "author": "Cryptopolitan",
            "url": "https://article.wn.com/view/2025/05/18/Tariffs_will_push_people_deeper_into_digital_worlds_says_Ani",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Web3's next chapter is imminent. Animoca Brands co-founder Yat Siu explains how digital property rights, AI agents, and decentralized identities will shape the internet's future in an interview with Cryptopolitan. Web3's mission is to make digital property right standard in the world."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Retired artist loses $2M in crypto to Coinbase impersonator",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Retired_artist_loses_2M_in_crypto_to_Coinbase_impersonator",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Ed Suman, 67, lost over $2 million in cryptocurrency to a scam involving someone posing as a Coinbase support representative. Suman spent nearly two decades as a fabricator in the art world, and he lost the money as a result of that work. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "ADA and XRP holders are watching MUTM closely — And it's still trading under $0.03",
            "author": "Cyprus Mail",
            "url": "https://article.wn.com/view/2025/05/18/ADA_and_XRP_holders_are_watching_MUTM_closely_And_it_s_still",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Mutuum is one of the new crypto coins with untapped potential. Cardano (ADA) and XRP (XRP) have long been considered go-to assets for strategic crypto portfolios, but as both projects enter a phase of ecosystem expansion and regulatory evolution, their long-term holders are beginning to explore new coins."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "BNB Trades in Tight Range Amid Decreasing Volatility",
            "author": "Coin Desk",
            "url": "https://article.wn.com/view/2025/05/18/BNB_Trades_in_Tight_Range_Amid_Decreasing_Volatility",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "BNB trades within a tight consolidation range between $636-$646. The token's price action shows resilience amid international trade disputes, with higher lows forming at higher highs. BNB is traded on CoinDesk Research's technical analysis data model, which is based on data from CoinDesk."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin Dominance Dives in May as Altcoins Form Golden Cross",
            "author": "Crypto Potato",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Dominance_Dives_in_May_as_Altcoins_Form_Golden_Cross",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "It's a sign of a bullish market for all crypto assets that are not called BTC. Bitcoin's market share fell from 65% to 61% between May 7 and May 13. Last time this happened in 2021, a bevy of popular altcoins returned cryptocurrency buyers 28,000% by the end of the market cycle."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "On-Chain Data Tips Bitcoin To Peak At $120,000 – But On This Condition",
            "author": "News BTC",
            "url": "https://article.wn.com/view/2025/05/18/onchain_data_tips_bitcoin_to_peak_at_120000_8211_but_on_this",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin's price has risen 37.5% since mid-April to trade as high as $105,490. Expert Ali Martinez has tipped the market to cool off soon.       in his latest article. He claims that the market is cooling off. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin Nears Golden Cross Weeks After 'Trapping Bears' as U.S. Debt Concerns Mount",
            "author": "Coin Desk",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Nears_Golden_Cross_Weeks_After_Trapping_Bears_as_US__7",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin's price chart is echoing a bullish pattern that foreshadowed the late 2024 price surge from $70,000 to $100,000. The leading cryptocurrency by market value appears on track to confirm a \"golden cross\" in the coming days, according to charting."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "US Bitcoin ETFs Record 5th-Straight Week Of Positive Inflows — But Demand Might Be Waning",
            "author": "Bitcoinist",
            "url": "https://article.wn.com/view/2025/05/18/US_Bitcoin_ETFs_Record_5thStraight_Week_Of_Positive_Inflows_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The US-based Bitcoin ETFs (exchange-traded funds) continued their red-hot streak of positive inflows in the past week. These crypto-based financial products posted over $600 million in net capital influx over the last five trading days."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Stocks, Bitcoin, and gold within striking distance of ATHs, bullish breakout brewing?",
            "author": "Cryptopolitan",
            "url": "https://article.wn.com/view/2025/05/18/Stocks_Bitcoin_and_gold_within_striking_distance_of_ATHs_bul",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The global digital assets market saw a marginal surge on Sunday morning to stand $3.31 trillion cap. This comes after witnessing a week of fluctuations due to the rise in Bitcoin's dominance. However, the stock markets and crypto are still nearly correlated.    "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Will the Next Move in Bitcoin Prices Lead to a Record or Is a Correction ...",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Will_the_Next_Move_in_Bitcoin_Prices_Lead_to_a_Record_or_Is_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Cryptocurrency analyst Ali Martinez predicted what the next move in Bitcoin price could be in his statement. He wrote: Will the Next Move in Bitcoin Prices Lead to a Record or Is a Correction on the Way? Analyst Outlines the Outlines in the statement."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin Hitting $250,000 In 2025 Is ‘Totally Possible', According To Popular Crypto Pundit",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Hitting_250000_In_2025_Is_Totally_Possible_According",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A widely followed crypto analyst says Bitcoin (BTC) is going to reach $250,000 this year and it's going to go up by a lot more than that.      Â   i.e. Bitcoin is going up by $250k this year."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin Bulls Face Make-Or-Break Moment At $106,500 Resistance",
            "author": "News BTC",
            "url": "https://article.wn.com/view/2025/05/18/bitcoin_bulls_face_makeorbreak_moment_at_106500_resistance_8",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin is currently retesting a price resistance at the $106,500 price region. Based on the asset's performance at this level, BTC investors could expect a bullish price continuation or a significant price pullback. After a brief rise, Bitcoin's price fell slightly."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Following Pectra, Ethereum Fees Stay Low as Bitcoin Fee Market Remains Soft",
            "author": "Bitcoin",
            "url": "https://article.wn.com/view/2025/05/18/Following_Pectra_Ethereum_Fees_Stay_Low_as_Bitcoin_Fee_Marke_1",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Pectra upgrade to the Etherum network has been fully implemented. Gas fees across the network have stayed minimal. The median-sized transactions are still the same, with transactions of median size of 1.5 ETH/GZ. The upgrade has been successful. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Ark Invest's Cathie Wood Predicts Bitcoin To Hit $1.5 Million By 2030 — Here's Why",
            "author": "Bitcoinist",
            "url": "https://article.wn.com/view/2025/05/18/ark_invest_8217s_cathie_wood_predicts_bitcoin_to_hit_15_mill",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Cathie Wood, CEO of Ark Invest, has backed Bitcoin to achieve a $1.5 million price point by 2030. She has based this projection on rising institutional investment and global recognition of Bitcoin's ability to serve as a currency. The American investor and cryptocurrency advocate has based it on multiple factors."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Best Crypto to Buy Now as BitPay Launches HODL Pay – DeFi Meets Everyday Spending",
            "author": "Brave New Coin",
            "url": "https://article.wn.com/view/2025/05/18/Best_Crypto_to_Buy_Now_as_BitPay_Launches_HODL_Pay_DeFi_Meet",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "It's a game-changer for those who want to spend while still holding onto their investments. Emerging projects like Dawgz AI are also making waves, blending DeFi with real-world applications. Let's explore the top cryptocurrencies ready for growth in this new era of crypto utility."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin Price Could Be Preparing For Fresh Wave Of Volatility — Here's Why",
            "author": "News BTC",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Price_Could_Be_Preparing_For_Fresh_Wave_Of_Volatilit",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Bitcoin price action over the weekend has been sluggish, reflecting the indecision and fatigue hovering over the cryptocurrency market at the moment. The premier cryptocurrency has continued to trade within the $92,000 – $95,000 range on Saturday, May 17. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin Jumps Above $105K for First Time Since January as XRP, Dogecoin Rise",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Jumps_Above_105K_for_First_Time_Since_January_as_XRP",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin is now 3% away from its all-time high. Dogecoin, XRP, and ETH gain, while Bitcoin Cash, ETH, and DOGE lose ground.    - Bitcoin Cash is down 3%. Dogecoins gain, ETH gain and Bitcoin Cash rises."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Analytics Company CEO Warns: 'This Altcoin Will Decline in Value Against Bitcoin'",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Analytics_Company_CEO_Warns_This_Altcoin_Will_Decline_in_Val",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Joao Wedson, CEO of Alphractal, warned about an altcoin for BTC parity. He said it will decline in value against Bitcoin and it will not be as popular as Bitcoin. He also warned that it will be less valuable than Bitcoin. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Exploring South Africa's Garden Route: A Bitcoin Enthusiast's Ultimate Guide",
            "author": "MENA FN",
            "url": "https://article.wn.com/view/2025/05/18/Exploring_South_Africas_Garden_Route_A_Bitcoin_Enthusiasts_U",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Traveling to South Africa is an exciting adventure for Bitcoin enthusiasts looking to explore the picturesque Garden Route. This coastal paradise offers a unique blend of rich and beautiful scenery.      Â   .   in Menafn - Crypto Breaking."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin Soars To $105K, Triggers A $250B Cryptocurrency Rally And A Market Frenzy",
            "author": "Crypto Ninjas",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Soars_To_105K_Triggers_A_250B_Cryptocurrency_Rally_A",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin hits $105,327, surging over 37% in less than a month and boosting overall market cap by over $100,000. Bitcoin is now worth over $1.2 billion.       i.e. the market cap of Bitcoin has increased by $100 million."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "$22,000,000,000,000 Market Cap in Store for Bitcoin (BTC) and Crypto, According to Billionaire Mike Novogratz",
            "author": "The Daily Hodl",
            "url": "https://article.wn.com/view/2025/05/18/22000000000000_Market_Cap_in_Store_for_Bitcoin_BTC_and_Crypt",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Mike Novogratz is the CEO of Galaxy Digital. He believes the market cap of Bitcoin and crypto will eventually catch up to the valuation of one soaring asset. He thinks the recent market correction is due to an overexuberant investor sentiment and the rise of Bitcoin."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin vs USD: Why BTC is yet to catch up to the dollar for global dominance",
            "author": "The Economic Times",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_vs_USD_Why_BTC_is_yet_to_catch_up_to_the_dollar_for__w",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin's rise highlights growing interest in decentralised finance, but it remains far from mainstream yet.    - Bitcoin is not ready for mainstream adoption yet. Bitcoin is still not ready to be mainstream yet, as it is still very young and unstable. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Ethereum Price Struggles To Hold Above $2,500 — Watch Out For This Support Level",
            "author": "News BTC",
            "url": "https://article.wn.com/view/2025/05/18/Ethereum_Price_Struggles_To_Hold_Above_2500_Watch_Out_For_Th",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Ether's price has risen by 35% in the month of May. It reached a high of $2,700 on Tuesday, May 13, but has since dropped back to around $1,700. The altcoin has struggled to build on its momentum over the past few days."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "‘Bitcoin Standard' author backs funding dev to make spamming Bitcoin costly",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Standard_author_backs_funding_dev_to_make_spamming_B",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Saifedean Ammous would like to throw in a few sats to fund a full-time developer focused on making Bitcoin. He is an economist and author of The Bitcoin Standard. He has commented on the ongoing debate over spam inscriptions on the Bitcoin network."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Investors are positioning for the next breakout — and this new cryptocurrency is leading the shift",
            "author": "Invezz",
            "url": "https://article.wn.com/view/2025/05/18/Investors_are_positioning_for_the_next_breakout_and_this_new",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "As the crypto market shows signs of building momentum, investors are beginning to shift from passive observation to active positioning. The focus is no longer just on well-established tokens, but on newer, fundamentally solid projects that offer both early-stage entry and near-term upside."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "$10 Million Bitcoin? Investment Pro Calls It ‘Opportunity' Of A Lifetime",
            "author": "News BTC",
            "url": "https://article.wn.com/view/2025/05/18/10_million_bitcoin_investment_pro_calls_it_8216opportunity_8",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin has broken past $100,000 after months of little movement. It now trades near $103,484. Some people see it as a buying chance, others warn it could rise further. According to Lawrence Lepard, there is a big difference ahead for people based on their current financial situation."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Jamining Launches New Cloud Mining Contracts For Trending Altcoins Solana (SOL) And Cardano (ADA)",
            "author": "MENA FN",
            "url": "https://article.wn.com/view/2025/05/18/Jamining_Launches_New_Cloud_Mining_Contracts_For_Trending_Al",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "There is growing demand for Diversified Crypto Mining JAMining, which is the future of digital currency. It offers passive income opportunities for investors. It is based in London and is a venture capital company with a focus on digital currency mining.   "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Breaking Down Trump's Entanglements With Crypto",
            "author": "Wall Street Journal",
            "url": "https://article.wn.com/view/2025/05/18/breaking_down_trump_x2019s_entanglements_with_crypto",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The cryptocurrency sector has been one of the biggest winners during the president's second term so far during the second term of the current administration.      Â   .   in the cryptocurrency sector. in the U.S. it is worth $20 billion."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin Surges Again: Is it Time to Dive into Altcoins?",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Surges_Again_Is_it_Time_to_Dive_into_Altcoins",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin reaches new heights, pushing altcoins into potential surge territory. Key to the success of altcoins is the development of a stable exchange rate. Bitcoin's value is expected to rise further.    in the coming days. Bitcoin is worth $10,000 now."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Germany's BaFIN grants crypto license to Trade Republic amid slow MiCA rollout",
            "author": "Cryptopolitan",
            "url": "https://article.wn.com/view/2025/05/18/Germany_s_BaFIN_grants_crypto_license_to_Trade_Republic_amid",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Trade Republic has secured a full license from Germany's financial regulator BaFIN to offer crypto services. It is the latest company to get licensed under the Market in Crypto Assets (MiCA) framework. Circle Senior Director for EU Strategy and Policy shared that the race is on for MiCA licenses."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Best Crypto to invest in: Experts back ADA, MUTM and DOGE",
            "author": "Invezz",
            "url": "https://article.wn.com/view/2025/05/18/Best_Crypto_to_invest_in_Experts_back_ADA_MUTM_and_DOGE",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Cardano, Mutuum Finance and Dogecoin are being highlighted as the best cryptocurrencies to purchase right now due to a surge in investor interest. Experts estimate that strong fundamentals and market momentum might propel these currencies to 500% gains in 2025. Optimism is being fuelled by"
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Myth or reality? MiCA and its real impact on the market debunking common misconceptions",
            "author": "Cryptoslate",
            "url": "https://article.wn.com/view/2025/05/18/Myth_or_reality_MiCA_and_its_real_impact_on_the_market_debun",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Markets in Crypto Assets Regulation (MiCA) seeks to protect investors and make the rules clear for European crypto companies. According to Mike Romanenko, CVO and Co-Founder of Kyrrex, they keep worried about the regulation.    "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Here's Solana Price Prediction if Helius CEO's Insights Drive SOL above Ethereum's $300B Market Cap",
            "author": "Coin Gape",
            "url": "https://article.wn.com/view/2025/05/18/Here_s_Solana_Price_Prediction_if_Helius_CEO_s_Insights_Driv",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Solana price consolidates above $165 as bulls eye a breakout toward $184. Stable fees and Layer-1 momentum drive investor interest. Helius CEO Weighs-in on L2 Fee Debates. Solana price rebound above $170 on Sunday May 17."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "What Is A Cryptocurrency ETF? A Guide For Crypto Investors Looking To Diversify",
            "author": "Forbes",
            "url": "https://article.wn.com/view/2025/05/18/What_Is_A_Cryptocurrency_ETF_A_Guide_For_Crypto_Investors_Lo",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Crypto ETFs explained: A simpler way to invest in cryptocurrency. Discover the benefits and risks for investors aiming to diversify their portfolio and choose the right exchange-traded fund to do it.      Â   .  "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Dogecoin (DOGE) Whales Accumulate 1 Billion DOGE Amid Critical Support Formation",
            "author": "Coin Desk",
            "url": "https://article.wn.com/view/2025/05/18/Dogecoin_DOGE_Whales_Accumulate_1_Billion_DOGE_Amid_Critical",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Dogecoin has maintained support above key moving averages and is forming a potential bull flag pattern that could target $0.35 if Whale Accumulation Signals Bull Flag Breakout. Geopolitical tensions and evolving trade policies continue to influence cryptocurrency markets, but Dogecoin shows resilience."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "ETH, LINK, MKR withdrawals surge: Are smart investors front-running a new altseason?",
            "author": "AMB Crypto",
            "url": "https://article.wn.com/view/2025/05/18/ETH_LINK_MKR_withdrawals_surge_Are_smart_investors_frontrunn",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Altcoin outflows and strong gains suggest early signs of a shift away from Bitcoin dominance, according to some analysts. The data is based on data from CoinMarketCap.com's analysis.    for the moment, the data is not accurate. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin Must Close Above $107,000 To Confirm Breakout Or Risk Dropping To $98K",
            "author": "News BTC",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Must_Close_Above_107000_To_Confirm_Breakout_Or_Risk_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "After a powerful rally earlier this month, Bitcoin's price action has stalled just above $103,000. The daily chart shows consistent resistance just below $107,000, with the latest candles forming in a compressed horizontal band, indicating indecision and indecision."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin Price Watch: Market Hovers Below $104K as Traders Eye Breakout",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Price_Watch_Market_Hovers_Below_104K_as_Traders_Eye_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin traded at $103,895 on May 18, 2025. Bitcoin has a market capitalization of $2.064 at that time. Bitcoin's value was $103.895 at May 18th, 2025, when it was traded. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "'Rich Dad Poor Dad' Author Predicts $250K Bitcoin in 2025",
            "author": "Coin Edition",
            "url": "https://article.wn.com/view/2025/05/18/Rich_Dad_Poor_Dad_Author_Predicts_250K_Bitcoin_in_2025",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin has gained 42% since the beginning of Q2 2025. Robert Kiyosaki predicts Bitcoin will reach $250,000 before the end of 2025. The Marxist Central Bank system is crashing and many people are going bankrupt.      "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Could Ruvi AI (RUVI) Surpass Dogecoin (DOGE) in 2025? Experts Expect $1.00 Price Valuation and ...",
            "author": "Cryptopolitan",
            "url": "https://article.wn.com/view/2025/05/18/Could_Ruvi_AI_RUVI_Surpass_Dogecoin_DOGE_in_2025_Experts_Exp",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Dogecoin is consolidating at $0.21 and is about to break $1.25. Whale activity is surging with over 1 billion DOGE added in the last month. Dogecoin riding on market optimism and community support.   "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Dogecoin Price Tests Panic Zone At $0.21, Breakdown Could Lead To Price Crash",
            "author": "News BTC",
            "url": "https://article.wn.com/view/2025/05/18/Dogecoin_Price_Tests_Panic_Zone_At_021_Breakdown_Could_Lead_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Dogecoin is showing signs of selling pressure after shedding much of the bullish momentum it had gathered in late April and early May. Technical analysis of the Dogecoin price shows that the meme cryptocurrency is precariously hovering just above a key support level that puts it one step away from a downtrend."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "MUTM and DOGE price prediction – Next Cryptocurrencies to hit $1?",
            "author": "Cyprus Mail",
            "url": "https://article.wn.com/view/2025/05/18/mutm_and_doge_price_prediction_8211_next_cryptocurrencies_to",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Dogecoin (DOGE) is surging with a 528% spike in active addresses. The token rocketed from 74,640 to 469,477, fueled by an updated 21Shares filing for a spot Dogecoin ETF, acknowledged by the SEC on May 14."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Paris Family Fights Off Masked Gang in Crypto-Linked Kidnapping Attempt",
            "author": "Crypto Potato",
            "url": "https://article.wn.com/view/2025/05/18/Paris_Family_Fights_Off_Masked_Gang_in_CryptoLinked_Kidnappi",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "A gang tried to abduct the daughter and young grandson of a crypto company executive in Paris. The attackers fled empty-handed after a violent struggle. This incident is part of a trend of violent cases targeting individuals connected to the crypto industry in France.   "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Crypto execs beef up security following string of kidnappings: Report",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Crypto_execs_beef_up_security_following_string_of_kidnapping",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Crypto industry executives are beefing up personal security and demanding more bodyguards.      Â   for more security guards. For confidential support call the National Suicide Prevention Lifeline at 1-800-273-8255. For support on suicide matters call the Samaritans on 08457 90 90 90."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Mastermind Behind SEC SIM Swapping Scheme Sentenced to 14 Months in Prison for Manipulating Bitcoin Price",
            "author": "The Daily Hodl",
            "url": "https://article.wn.com/view/2025/05/18/Mastermind_Behind_SEC_SIM_Swapping_Scheme_Sentenced_to_14_Mo",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Eric Council Jr. hacked an X account associated with the SEC last year and manipulated the value of Bitcoin. He has been sentenced to 14 months behind bars for the crime. The SEC has accused Council of manipulating Bitcoin's value by hacking the X account.  "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin Signals a New Bullish Phase with Golden Cross",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Signals_a_New_Bullish_Phase_with_Golden_Cross",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin's golden cross suggests a potential strong upward trend. Economic and technical factors could be the reason for this trend.    - Bitcoin's technical and economic factors are the reason behind it. Bitcoin's growth is driven by economic and technical reasons, not just Bitcoin itself."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Panama City Eyes Bold Move With Potential Bitcoin Reserve",
            "author": "Bitcoin",
            "url": "https://article.wn.com/view/2025/05/18/Panama_City_Eyes_Bold_Move_With_Potential_Bitcoin_Reserve_p",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The mayor of Panama City might be on the verge of taking an important step in becoming a bitcoin pioneer.    .      in the future Panama City will become a bitcoin-friendly city, according to the mayor.  In the past, Panama City has not accepted Bitcoin. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Will Ruvi AI (RUVI) Beat Cardano's (ADA) Multichain Breakthrough? Analysts Expect 20,000% Potential Thanks to ...",
            "author": "Cryptopolitan",
            "url": "https://article.wn.com/view/2025/05/18/Will_Ruvi_AI_RUVI_Beat_Cardano_s_ADA_Multichain_Breakthrough",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Cardano (ADA) is making headlines again and currently priced at $0.73. With its Lace wallet's cross-chain integration with Bitcoin, the stage is set for unprecedented interoperability. Analysts think ADA could hit $1 soon with its focus on innovation and use cases."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Texas makes a push for bronze in state-level Bitcoin reserve race",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Texas_makes_a_push_for_bronze_in_statelevel_Bitcoin_reserve_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Texas could become the third US state to adopt a state-level Bitcoin reserve. New Hampshire and Arizona are the other two states that have done so so so far. The reserve will be in the form of a Bitcoin reserve, like in Arizona and New Hampshire."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "SUI Surges After Finding Strong Support at $3.75 Level",
            "author": "Coin Desk",
            "url": "https://article.wn.com/view/2025/05/18/SUI_Surges_After_Finding_Strong_Support_at_375_Level",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Sui is up 5.16% intra-day. The asset established a trading range of 4.46% between $3.70-$3.86, finding strong volume support at the $3:755 level. Global economic tensions and shifting trade policies continue to influence cryptocurrency markets."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin Shows Relative Weakness Against Stocks – Pause Or Warning Sign?",
            "author": "Bitcoinist",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_Shows_Relative_Weakness_Against_Stocks_Pause_Or_Warn",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "After a quiet weekend of low volatility, Bitcoin is preparing for a decisive move. Price action has consolidated into a tight range between $100,000 and $105,000. Bulls remain in control for now, but the momentum is fragile and could quickly shift if BTC breaks."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin stalls, but chart watchers eye $300,000 peak: Here's when",
            "author": "BTC Manager",
            "url": "https://article.wn.com/view/2025/05/18/bitcoin_stalls_but_chart_watchers_eye_300000_peak_here_8217s",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin price has stalled below $105,000. Popular model points to a surge to between $275,000 and $300,000 by October this year, according to a popular model.    -  -   for more information. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Chart of the week: Bonk to extend gains, rally 10% next week?",
            "author": "BTC Manager",
            "url": "https://article.wn.com/view/2025/05/18/Chart_of_the_week_Bonk_to_extend_gains_rally_10_next_week",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bonk, the meme coin of the dog-themed community and a utility token, has lost nearly 14% of its value in the last 24 hours. It's the most valuable coin in the Bitcoin market. It is used to buy and sell utility tokens."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Metaplanet Hits All-Time High $6M Q1 Revenue as BTC Holdings Surge 3.9x",
            "author": "Crypto Potato",
            "url": "https://article.wn.com/view/2025/05/18/Metaplanet_Hits_AllTime_High_6M_Q1_Revenue_as_BTC_Holdings_S",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Japanese hospitality firm Metaplanet has disclosed record-breaking earnings for the first quarter of the year. According to the firm's Q1 Earnings, its Bitcoin strategy contributed 88% to its revenue of 877 million Japanese yen ($6 million). The global feedback loop between capital markets and Bitcoin is just beginning. Metaplanet intends to be its premier conduit."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Can Ripple (XRP) Hit $10 in 2025? ChatGPT Answers",
            "author": "Crypto Potato",
            "url": "https://article.wn.com/view/2025/05/18/Can_Ripple_XRP_Hit_10_in_2025_ChatGPT_Answers",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "ChatGPT believes XRP will rise by 320% from current levels and reach double-digit territory in a matter of months. ChatGPT is a member of the Bitcoin and cryptocurrency community and has a vested interest in XRP's future development.  "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Cardano Risks Falling Below $0.75",
            "author": "Coin Idol",
            "url": "https://article.wn.com/view/2025/05/18/Cardano_Risks_Falling_Below_075",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The price of Cardano (ADA) is bearish after being rejected twice at the $0.84 level. The cryptocurrency would have risen to a high of $1.02 if the barrier had been breached. Cardano has been declining since May 11, with the price falling above the 21-day moving average."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Michael Saylor Prepares Massive Bitcoin Purchase as Market Watches Closely",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/Michael_Saylor_Prepares_Massive_Bitcoin_Purchase_as_Market_W",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Michael Saylor hints at a significant Bitcoin purchase energizing the market. In the past similar scenarios, the market has reacted positively to such hints.    .   in past similar situations, the Bitcoin market has responded positively to the hints. in the past. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin STH Unrealized Profits Reach 21% – Is There Room To Grow?",
            "author": "Bitcoinist",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_STH_Unrealized_Profits_Reach_21_Is_There_Room_To_Gro",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin is trading in a narrow range between $100,000 and $105,000. After weeks of bullish momentum and a sharp climb from April lows, the market has entered a phase of quiet consolidation. The current price action may seem uneventful, but investors are impatient for the next move."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Crypto Exchanges Oppose Brazil's Stablecoin Self-Custody Ban",
            "author": "Bitcoin",
            "url": "https://article.wn.com/view/2025/05/18/Crypto_Exchanges_Oppose_Brazil_s_Stablecoin_SelfCustody_Ban",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The Central Bank of Brazil proposes a ban on crypto transactions in Brazil. Cryptos see the proposal as excessive and warn that it might be a bad idea for the economy. The ban proposal is spearheaded by the Central Bank.    -   for now. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Paris kidnap attempt highlights need for crypto data security",
            "author": "Cryptopolitan",
            "url": "https://article.wn.com/view/2025/05/18/Paris_kidnap_attempt_highlights_need_for_crypto_data_securit",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "There has been an increase in kidnappings linked to the crypto community in Paris. The latest one was the attempted kidnapping of relatives of Paymium co-founder Pierre Noizat on Tuesday. The kidnapping situation was worsened by the attempt on Noizats' family."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Bitcoin's Wild Ride: Bulls Charge Toward All-Time High as $27M in Bearish Bets Vanish",
            "author": "Bitcoin",
            "url": "https://article.wn.com/view/2025/05/18/Bitcoin_s_Wild_Ride_Bulls_Charge_Toward_AllTime_High_as_27M_",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "Bitcoin reached an intraday peak of $105,680. Bitcoin is up 2.5% versus the U.S. dollar today.       Bitcoin's value is buoyant as traders revel in its buoyant nature. Bitcoin's market cap is now at $20.5 billion."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Paris kidnap bid highlights crypto data security risks",
            "author": "The Daily Gazette",
            "url": "https://article.wn.com/view/2025/05/18/Paris_kidnap_bid_highlights_crypto_data_security_risks",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "New regulations threaten the security of the personal data of cryptocurrency users, the platform at the centre of last week's Paris kidnapping attempt has claimed. It may expose them to \"physical danger\" according to the platform's CEO, who is also a member of the Bitcoin Foundation."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "China debuts world's first quantum cryptography system it claims is ‘unhackable'",
            "author": "Interesting Engineering",
            "url": "https://article.wn.com/view/2025/05/18/china_debuts_world_8217s_first_quantum_cryptography_system_i",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "The China Telecom has introduced what it claims to be the world's first commercial cryptography system resistant to even quantum computer attacks. It's a response to the growing risks of quantum computing and new algorithms in traditional encryption. It is a government-owned company in China."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "Trump Meme Coin Dinner: Non-US Investors Dominate Attendees List",
            "author": "Coin Gape",
            "url": "https://article.wn.com/view/2025/05/18/Trump_Meme_Coin_Dinner_NonUS_Investors_Dominate_Attendees_Li",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "President Donald Trump's gala dinner for top Trump coin holders takes place on May 22. The leaderboard of 220 invitees is heavily populated by wallet addresses linked to exchanges linked to non-US investors, according to reports from CNBC and Bloomberg. The winners list of the gala is dominated by non-U.S. investors."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "This Week in Crypto Games: 'MapleStory N' Hits Avalanche, Solana's 'Nyan Heroes' Shuts Down",
            "author": "Bit RSS",
            "url": "https://article.wn.com/view/2025/05/18/This_Week_in_Crypto_Games_MapleStory_N_Hits_Avalanche_Solana",
            "url_media": "https://ecdn0.wn.com/st/favicon-20131209.ico",
            "country": "US",
            "language": "en",
            "summary": "It was another busy week for crypto games, with the big MapleStory N launch on Avalanche and Solana's Nyan Heroes closing up shop.       in the last week there was the launch of MapleStory on Avalanche, and more. "
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "$TRUMP dinner blurs lines between profit and politics",
            "author": "TASOS KATOPODIS",
            "url": "https://www.dailygazette.com/news/national/trump-dinner-blurs-lines-between-profit-and-politics/article_047eb1e2-1132-5402-9009-0890981bde15.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/dailygazette.com/content/tncms/assets/v3/editorial/5/10/510c444a-2744-5e47-a01c-9b34539f28a8/682aa23be1ef3.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "More than two hundred guests will attend a dinner hosted by the president of the United States on Thursday. The lucky few are the 220 biggest buyers of $Trump, a crypto currency launched by the US president in January. Javascript is required to be able to read premium content."
        },
        {
            "published_date": "2025-05-18T00:00:00",
            "title": "$TRUMP dinner blurs lines between profit and politics",
            "author": "TASOS KATOPODIS",
            "url": "https://starlocalmedia.com/news/national/trump-dinner-blurs-lines-between-profit-and-politics/article_116f049e-4356-541f-86aa-d64b5c913222.html",
            "url_media": "https://bloximages.chicago2.vip.townnews.com/starlocalmedia.com/content/tncms/assets/v3/editorial/c/02/c028ab89-9ca3-5649-8028-9f84b62d728b/682aa2be6ccf2.image.jpg?crop=341%2C341%2C85%2C0&resize=200%2C200&order=crop%2Cresize",
            "country": "US",
            "language": "en",
            "summary": "More than two hundred guests will attend a dinner hosted by the president of the United States on Thursday. The lucky few are the 220 biggest buyers of $TRUMP, a crypto-memecoin launched by the US president in January. The dinner will take place at a country club just up the Potomac River from Washington."
        }
    ]
}